&ИзменениеИКонтроль("СоздатьВТЗарплатаКВыплатеАванс")
Процедура Расш_СоздатьВТЗарплатаКВыплатеАванс(МенеджерВременныхТаблиц, ТолькоРазрешенные, Параметры, ИмяВТСотрудники) 
	
	// аванс при наличии окончательного расчета по сотруднику не выплачивается
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Организация",				Параметры.Организация);
	Запрос.УстановитьПараметр("ПериодРегистрации",			Параметры.ПериодРегистрации);
	Запрос.УстановитьПараметр("ИгнорируемыеРегистраторы",	Параметры.ИгнорируемыеРегистраторы);	
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Сотрудники.Сотрудник КАК Сотрудник
	|ПОМЕСТИТЬ ВТСотрудникиБезОкончательногоРасчета
	#Удаление
	|ИЗ
	|	#ВТСотрудники КАК Сотрудники	
	|ГДЕ
	|	НЕ Сотрудники.Сотрудник В
	|				(ВЫБРАТЬ
	|					ВзаиморасчетыССотрудниками.Сотрудник КАК Сотрудник
	|				ИЗ
	|					РегистрНакопления.ВзаиморасчетыССотрудниками КАК ВзаиморасчетыССотрудниками
	|				ГДЕ
	|					ВзаиморасчетыССотрудниками.Период = &ПериодРегистрации
	|					И ВзаиморасчетыССотрудниками.Организация = &Организация
	|					И ВзаиморасчетыССотрудниками.ВидВзаиморасчетов = ЗНАЧЕНИЕ(Перечисление.ВидыВзаиморасчетовССотрудниками.ВыплатаЗарплаты)
	|					И НЕ ВзаиморасчетыССотрудниками.Регистратор В (&ИгнорируемыеРегистраторы)
	|					И ВзаиморасчетыССотрудниками.Сотрудник В
	|						(ВЫБРАТЬ
	|							Сотрудники.Сотрудник
	|						ИЗ                               	
	|							#ВТСотрудники КАК Сотрудники))";
	#КонецУдаления
	#Вставка
	|ИЗ
	|	#ВТСотрудники КАК Сотрудники";	
	#КонецВставки
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "#ВТСотрудники", ИмяВТСотрудники);
	
	Запрос.Выполнить();
	
	ВзаиморасчетыССотрудникамиБазовый.СоздатьВТЗарплатаКВыплате(МенеджерВременныхТаблиц, ТолькоРазрешенные, Параметры, "ВТСотрудникиБезОкончательногоРасчета");
	
	ЗарплатаКадры.УничтожитьВТ(МенеджерВременныхТаблиц, "ВТСотрудникиБезОкончательногоРасчета");
	
КонецПроцедуры	
