
&ИзменениеИКонтроль("ПодготовитьДанныеДляЗаполнения")
Процедура АБ_ПодготовитьДанныеДляЗаполнения(СтруктураПараметров, АдресХранилища)

	РезультатЗаполнения = Новый Структура;

	// Получение данных для заполнения табличных частей документа.
	ОписаниеДокумента = СтруктураПараметров.ОписаниеДокумента;
	Организация = СтруктураПараметров.Организация;
	МесяцНачисления = СтруктураПараметров.МесяцНачисления;

	ДополнительныеПараметры = РасчетЗарплатыРасширенный.ДополнительныеПараметрыЗаполненияТаблицДокумента();
	ДополнительныеПараметры.ДокументСсылка = СтруктураПараметров.ДокументСсылка;
	ДополнительныеПараметры.Подразделение = СтруктураПараметров.Подразделение;
	ДополнительныеПараметры.ОкончаниеПериода = СтруктураПараметров.ОкончаниеПериода;
	ДополнительныеПараметры.РежимНачисления = СтруктураПараметров.РежимНачисления;
	ДополнительныеПараметры.ПорядокВыплаты = СтруктураПараметров.ПорядокВыплаты;
	ДополнительныеПараметры.СотрудникиПериодДействияПерерасчет = СтруктураПараметров.СотрудникиПериодДействияПерерасчет;
	ДополнительныеПараметры.ИспользоватьВоеннуюСлужбу = СтруктураПараметров.ИспользоватьВоеннуюСлужбу;
	ДополнительныеПараметры.НачислениеЗарплатыВоеннослужащим = СтруктураПараметров.НачислениеЗарплатыВоеннослужащим;
	ДополнительныеПараметры.ОкончательныйРасчетНДФЛ = СтруктураПараметров.ОкончательныйРасчетНДФЛ;
	ДополнительныеПараметры.ПроверятьРегистрациюПроцентаЕНВД = СтруктураПараметров.ПроверятьРегистрациюПроцентаЕНВД;
	ДополнительныеПараметры.ДатаВыплаты = СтруктураПараметров.ДатаВыплаты;
	#Вставка
	ИспользоватьНеТиповойРасчетНочных=Ложь;
	ИспользоватьНеТиповойРасчетПраздничных=Ложь;
	Если СтруктураПараметров.Свойство("ИспользоватьНеТиповойРасчетНочных",ИспользоватьНеТиповойРасчетНочных) Тогда
	Иначе
	ИспользоватьНеТиповойРасчетНочных=Ложь;
	КонецЕсли;
	Если СтруктураПараметров.Свойство("ИспользоватьНеТиповойРасчетПраздничных",ИспользоватьНеТиповойРасчетПраздничных) Тогда
	Иначе
	ИспользоватьНеТиповойРасчетПраздничных=Ложь;
	КонецЕсли;
    ДополнительныеПараметры.ИспользоватьНеТиповойРасчетНочных=ИспользоватьНеТиповойРасчетНочных;
	ДополнительныеПараметры.ИспользоватьНеТиповойРасчетПраздничных=ИспользоватьНеТиповойРасчетПраздничных;
	//1АБ Беляев 08.03.2021 -
	#КонецВставки

	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.УправленческаяЗарплата") Тогда
		Модуль = ОбщегоНазначения.ОбщийМодуль("УправленческаяЗарплата");
		Модуль.ПриЗаполненииДополнительныхПараметровДанныхДляНачисленияЗарплаты(ДополнительныеПараметры);
	КонецЕсли;

	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.МногопотоковоеЗаполнениеДокументов") Тогда 
		Модуль = ОбщегоНазначения.ОбщийМодуль("МногопотоковоеЗаполнениеДокументов");
		Если Не РегистрыРасчета.Начисления.ЕстьДвиженияПоРегистратору(СтруктураПараметров.ДокументСсылка) И Модуль.ИспользоватьМногопотоковоеЗаполнениеДокументов() Тогда
			ДополнительныеПараметры.АдресХранилища = АдресХранилища;
			Модуль.ПодготовитьДанныеДляЗаполнения(ОписаниеДокумента, Организация, МесяцНачисления, ДополнительныеПараметры);
			Возврат;
		КонецЕсли;
	КонецЕсли;

	ДанныеЗаполнения = РасчетЗарплатыРасширенный.ДанныеДляЗаполненияТаблицДокумента(ОписаниеДокумента, Организация, МесяцНачисления, ДополнительныеПараметры);

	РезультатЗаполнения.Вставить("ДанныеДляЗаполненияТаблицДокумента", ДанныеЗаполнения);

	ПоместитьВоВременноеХранилище(РезультатЗаполнения, АдресХранилища);

КонецПроцедуры
