&ИзменениеИКонтроль("ТаблицаФормОтчета")
Функция АБ_ТаблицаФормОтчета() Экспорт

	ОписаниеТиповСтрока = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(254));

	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("Дата"));
	ОписаниеТиповДата = Новый ОписаниеТипов(МассивТипов, , Новый КвалификаторыДаты(ЧастиДаты.Дата));

	ТаблицаФормОтчета = Новый ТаблицаЗначений;
	ТаблицаФормОтчета.Колонки.Добавить("ФормаОтчета",        ОписаниеТиповСтрока);
	ТаблицаФормОтчета.Колонки.Добавить("ОписаниеОтчета",     ОписаниеТиповСтрока, "Утверждена",  20);
	ТаблицаФормОтчета.Колонки.Добавить("ДатаНачалоДействия", ОписаниеТиповДата,   "Действует с", 5);
	ТаблицаФормОтчета.Колонки.Добавить("ДатаКонецДействия",  ОписаниеТиповДата,   "         по", 5);
	ТаблицаФормОтчета.Колонки.Добавить("РедакцияФормы",      ОписаниеТиповСтрока, "Редакция формы", 20);

	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "ФормаОтчета2023Кв1";
	НоваяФорма.ОписаниеОтчета
	= "Приложение № 1 к приказу ФНС России от 15.10.2020 № ЕД-7-11/753@ (в ред. приказа ФНС России от 29.09.2022 № ЕД-7-11/881@).";
	НоваяФорма.РедакцияФормы      = "от 29.09.2022 № ЕД-7-11/881@.";
	НоваяФорма.ДатаНачалоДействия = '20230101';
	НоваяФорма.ДатаКонецДействия  = РегламентированнаяОтчетностьКлиентСервер.ПустоеЗначениеТипа(Тип("Дата"));

	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "ФормаОтчета2021Кв4";
	НоваяФорма.ОписаниеОтчета
	= "Приложение № 1 к приказу ФНС России от 15.10.2020 № ЕД-7-11/753@ (в ред. приказа ФНС России от 28.09.2021 № ЕД-7-11/845@).";
	НоваяФорма.РедакцияФормы      = "от 28.09.2021 № ЕД-7-11/845@.";
	НоваяФорма.ДатаНачалоДействия = '20211001';
	НоваяФорма.ДатаКонецДействия  = '20221231';

	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "ФормаОтчета2021Кв1";
	НоваяФорма.ОписаниеОтчета     = "Приложение № 1 к приказу ФНС России от 15.10.2020 № ЕД-7-11/753@.";
	НоваяФорма.РедакцияФормы      = "от 15.10.2020 № ЕД-7-11/753@.";
	НоваяФорма.ДатаНачалоДействия = '20210101';
	#Удаление
	НоваяФорма.ДатаКонецДействия  = '20211231';
	#КонецУдаления
	#Вставка
	НоваяФорма.ДатаКонецДействия  = '00010101000000';
	#КонецВставки

	Возврат ТаблицаФормОтчета;

КонецФункции
