#Область Доработка7_НДФЛ6_Расшифровка_ПолучениеДанныхДляОтчета
//1АБ+ Беляев 28.05.2021
&ИзменениеИКонтроль("ЗначенияПоказателей_6НДФЛ_2021Кв1")
Процедура АБ_ЗначенияПоказателей_6НДФЛ_2021Кв1(ПараметрыОтчета, Контейнер) Экспорт
	
	ДатаКонцаПериодаОтчета = ПараметрыОтчета.ДатаКонцаПериодаОтчета;
	Организация = ПараметрыОтчета.Организация;
	НачалоПериода = НачалоГода(ДатаКонцаПериодаОтчета);
	ОкончаниеПериода = КонецМесяца(ДатаКонцаПериодаОтчета);
	НомерКорректировки = ПараметрыОтчета.НомерКорректировки;
	Если ПараметрыОтчета.Свойство("РегистрацииВНО") Тогда
		РегистрацияВНалоговомОргане = ПараметрыОтчета.РегистрацииВНО;
	Иначе
		ТитульныйЛист = Контейнер.Титульный;
		ПараметрыОтбораРегистрацийВНО = Новый Структура;
		ПараметрыОтбораРегистрацийВНО.Вставить("КодНО", ТитульныйЛист.НалоговыйОрган);
		ПараметрыОтбораРегистрацийВНО.Вставить("ОКТМО", ТитульныйЛист.ОКТМО);
		Если СтрДлина(ТитульныйЛист.ИНН) = 10 Тогда
			ПараметрыОтбораРегистрацийВНО.Вставить("КПП", ТитульныйЛист.КПП);
			ПараметрыОтбораРегистрацийВНО.Вставить("ИскатьПоПервымСимволамОКТМО", Истина);
		КонецЕсли;
		РегистрацияВНалоговомОргане = РегламентированнаяОтчетность.РегистрацииОрганизацииВНалоговомОргане(Организация, ПараметрыОтбораРегистрацийВНО);
	КонецЕсли;
	ЗаполнятьПриложение1 = КонецМесяца(ОкончаниеПериода) = КонецГода(ОкончаниеПериода);
	Если ПараметрыОтчета.Свойство("ЗаполнятьПриложение1") Тогда
		ЗаполнятьПриложение1 = ПараметрыОтчета.ЗаполнятьПриложение1;
	КонецЕсли;
	
	НомерПервойСправки = 1;
	
	Если Не ЗначениеЗаполнено(РегистрацияВНалоговомОргане) Тогда
		Возврат
	КонецЕсли;
	                         
	// Очистка отчета
	ПоказателиОтчета = Новый Структура;
	ОписаниеПоказателей_6НДФЛ_2021Кв1(ПоказателиОтчета);
	
	ДанныеРаздела1 = Контейнер.Раздел1.Строки;
	ПоляКБК = ОбщегоНазначения.СкопироватьРекурсивно(ДанныеРаздела1[0].Данные); 
	ПоляСуммКПеречислению = ОбщегоНазначения.СкопироватьРекурсивно(ДанныеРаздела1[0].ДанныеМногострочныхЧастей.П00001М1.Строки[0].Данные);
	ПоляСуммВозврата = ОбщегоНазначения.СкопироватьРекурсивно(ДанныеРаздела1[0].ДанныеМногострочныхЧастей.П00001М2.Строки[0].Данные);
	ДанныеРаздела1.Очистить();
	ОчиститьПоляСтруктурыПоказателей(ПоказателиОтчета, ПоляКБК);
	ОчиститьПоляСтруктурыПоказателей(ПоказателиОтчета, ПоляСуммКПеречислению);
	ОчиститьПоляСтруктурыПоказателей(ПоказателиОтчета, ПоляСуммВозврата);
	
	ДанныеРаздела2 = Контейнер.Раздел2.Строки;
	ПоляРаздела2 = ОбщегоНазначения.СкопироватьРекурсивно(ДанныеРаздела2[0].Данные); 
	ДанныеРаздела2.Очистить();
	ОчиститьПоляСтруктурыПоказателей(ПоказателиОтчета, ПоляРаздела2);
	
	Если ЗаполнятьПриложение1 Тогда
		
		ДанныеПриложение1 = Контейнер.Приложение1.Строки;
		ДанныеСправки = ДанныеПриложение1[0].ДанныеМногострочныхЧастей.П000П1М1.Строки;
		ПоляНалогоплательщика = ОбщегоНазначения.СкопироватьРекурсивно(ДанныеПриложение1[0].Данные);
		ПоляИтогов = ОбщегоНазначения.СкопироватьРекурсивно(ДанныеСправки[0].Данные);
		ПоляВычетов = ОбщегоНазначения.СкопироватьРекурсивно(ДанныеСправки[0].ДанныеМногострочныхЧастей.П000П1М2.Строки[0].Данные);
		ПоляУведомленийОВычетах = ОбщегоНазначения.СкопироватьРекурсивно(ДанныеСправки[0].ДанныеМногострочныхЧастей.П000П1М3.Строки[0].Данные);
		ПоляНеудержано = ОбщегоНазначения.СкопироватьРекурсивно(ДанныеСправки[0].ДанныеМногострочныхЧастей.П000П1М4.Строки[0].Данные);
		ПоляДоходов = ОбщегоНазначения.СкопироватьРекурсивно(ДанныеСправки[0].ДанныеМногострочныхЧастей.П000П1М5.Строки[0].Данные);
		ПоляВычетовКДоходам = ОбщегоНазначения.СкопироватьРекурсивно(ДанныеСправки[0].ДанныеМногострочныхЧастей.П000П1М5.Строки[0].ДанныеМногострочныхЧастей.П000П1М6.Строки[0].Данные);
		ДанныеПриложение1.Очистить();
		ОчиститьПоляСтруктурыПоказателей(ПоказателиОтчета, ПоляНалогоплательщика);
		ОчиститьПоляСтруктурыПоказателей(ПоказателиОтчета, ПоляИтогов);
		ОчиститьПоляСтруктурыПоказателей(ПоказателиОтчета, ПоляВычетов);
		ОчиститьПоляСтруктурыПоказателей(ПоказателиОтчета, ПоляУведомленийОВычетах);
		ОчиститьПоляСтруктурыПоказателей(ПоказателиОтчета, ПоляДоходов);
		ОчиститьПоляСтруктурыПоказателей(ПоказателиОтчета, ПоляВычетовКДоходам);
		ОчиститьПоляСтруктурыПоказателей(ПоказателиОтчета, ПоляНеудержано);
		
	КонецЕсли;
	
	// Сбор данных
	ОписаниеТаблиц = Новый Структура("КоличествоПолучателейДохода, Раздел1Налоги, Раздел1Возвраты, Раздел2Доходы, Раздел2Вычеты, Раздел2Налоги, КоличествоПолучателейДохода");
	Если ЗаполнятьПриложение1 Тогда
		ОписаниеТаблиц.Вставить("Приложение1Налогоплательщики");	
		Если НомерКорректировки <> 99 Тогда
			ОписаниеТаблиц.Вставить("Приложение1Итоги");	
			ОписаниеТаблиц.Вставить("Приложение1Доходы");	
			ОписаниеТаблиц.Вставить("Приложение1Вычеты");	
			ОписаниеТаблиц.Вставить("Приложение1УведомленияОВычетах");	
		КонецЕсли;
	КонецЕсли;
	РасчетПоказателей_6НДФЛ_2021Кв1(НачалоПериода, ОкончаниеПериода, ?(ПараметрыОтчета.ДатаПодписи > ОкончаниеПериода,ПараметрыОтчета.ДатаПодписи, ОкончаниеПериода), Организация, РегистрацияВНалоговомОргане, ОписаниеТаблиц, Ложь, НомерКорректировки);	
	#Вставка
	//1АБ+ Беляев 28.05.2021
	НовоеОписаниеТаблиц = Неопределено;
	АБ_НДФЛ6Расшифровка_СкопироватьОписаниеТаблиц(НовоеОписаниеТаблиц,ОписаниеТаблиц);
	Контейнер.Вставить("ПолноеОписаниеТаблиц",НовоеОписаниеТаблиц);
	//1АБ- Беляев 28.05.2021
	#КонецВставки
	
	// Вывод данных в отчет
	
	ВсеКБК = Новый Массив;
	ВсеКБК.Добавить("18210102010011000110");
	ВсеКБК.Добавить("18210102060011000110");
	ВсеКБК.Добавить("18210102070011000110");
	ВсеКБК.Добавить("18210102080011000110");
	ПоискПоКБК = Новый Структура("КБК");
	
	// Раздел 1
	Налоги = ОписаниеТаблиц.Раздел1Налоги;
	Возвраты = ОписаниеТаблиц.Раздел1Возвраты;
	Для каждого КБК Из ВсеКБК Цикл
		
		ПоискПоКБК.КБК = КБК;
		СтрокиНалогов = Налоги.НайтиСтроки(ПоискПоКБК);
		СтрокиВозвратов = Возвраты.НайтиСтроки(ПоискПоКБК);
		
		Если СтрокиНалогов.Количество() > 0 Или СтрокиВозвратов.Количество() > 0 Тогда
			СтраницаРаздела1 = ДанныеРаздела1.Добавить();
			СтраницаРаздела1.Данные = ОбщегоНазначения.СкопироватьРекурсивно(ПоляКБК);
			СтраницаРаздела1.Данные.П000010001001 = КБК;
			СтраницаРаздела1.ДанныеМногострочныхЧастей = НовыеПустыеДанныеМногострочныхЧастей("П00001М1,П00001М2");
			Если СтрокиНалогов.Количество() = 0 Тогда
				НоваяСтрокаСуммКПеречислению = СтраницаРаздела1.ДанныеМногострочныхЧастей.П00001М1.Строки.Добавить();
				НоваяСтрокаСуммКПеречислению.Данные = ОбщегоНазначения.СкопироватьРекурсивно(ПоляСуммКПеречислению);
			КонецЕсли;
			Если СтрокиВозвратов.Количество() = 0 Тогда
				НоваяСтрокаСуммВозврата = СтраницаРаздела1.ДанныеМногострочныхЧастей.П00001М2.Строки.Добавить();
				НоваяСтрокаСуммВозврата.Данные = ОбщегоНазначения.СкопироватьРекурсивно(ПоляСуммВозврата);
			КонецЕсли;
		КонецЕсли;
		Для каждого СтрокаНалогов Из СтрокиНалогов Цикл
			НоваяСтрокаСуммКПеречислению = СтраницаРаздела1.ДанныеМногострочныхЧастей.П00001М1.Строки.Добавить();
			НоваяСтрокаСуммКПеречислению.Данные = ОбщегоНазначения.СкопироватьРекурсивно(ПоляСуммКПеречислению);
			ЗаполнитьЗначенияСвойств(НоваяСтрокаСуммКПеречислению.Данные, СтрокаНалогов);
		КонецЦикла;
		Для каждого СтрокаВозвратов Из СтрокиВозвратов Цикл
			НоваяСтрокаСуммВозврата = СтраницаРаздела1.ДанныеМногострочныхЧастей.П00001М2.Строки.Добавить();
			НоваяСтрокаСуммВозврата.Данные = ОбщегоНазначения.СкопироватьРекурсивно(ПоляСуммВозврата);
			ЗаполнитьЗначенияСвойств(НоваяСтрокаСуммВозврата.Данные, СтрокаВозвратов);
		КонецЦикла;
		
	КонецЦикла;
	Если ДанныеРаздела1.Количество() = 0 Тогда
		СтраницаРаздела1 = ДанныеРаздела1.Добавить();
		СтраницаРаздела1.Данные = ОбщегоНазначения.СкопироватьРекурсивно(ПоляКБК);
		СтраницаРаздела1.ДанныеМногострочныхЧастей = НовыеПустыеДанныеМногострочныхЧастей("П00001М1,П00001М2");
		СтраницаРаздела1.ДанныеМногострочныхЧастей.П00001М1.Строки.Добавить().Данные = ОбщегоНазначения.СкопироватьРекурсивно(ПоляСуммКПеречислению);
		СтраницаРаздела1.ДанныеМногострочныхЧастей.П00001М2.Строки.Добавить().Данные = ОбщегоНазначения.СкопироватьРекурсивно(ПоляСуммВозврата);
	КонецЕсли;
	
	// Раздел 2
	Доходы = ОписаниеТаблиц.Раздел2Доходы;
	Вычеты = ОписаниеТаблиц.Раздел2Вычеты;
	Налоги = ОписаниеТаблиц.Раздел2Налоги;
	Количество = ОписаниеТаблиц.КоличествоПолучателейДохода;
	ПоискПоКБКиСтавке = Новый Структура("КБК,Ставка");
	Для каждого Ставка Из Перечисления.НДФЛСтавки Цикл
		ПоискПоКБКиСтавке.Ставка = Ставка;
		Для каждого КБК Из ВсеКБК Цикл
			
			ПоискПоКБКиСтавке.КБК = КБК;
			СтрокиДоходов = Доходы.НайтиСтроки(ПоискПоКБКиСтавке);
			СтрокиВычетов = Вычеты.НайтиСтроки(ПоискПоКБКиСтавке);
			СтрокиНалогов = Налоги.НайтиСтроки(ПоискПоКБКиСтавке);
			СтрокиКоличества = Количество.НайтиСтроки(ПоискПоКБКиСтавке);
			
			Если СтрокиДоходов.Количество() > 0 Или СтрокиНалогов.Количество() > 0 Или СтрокиВычетов.Количество() > 0 Тогда
				СтраницаРаздела = ДанныеРаздела2.Добавить();
				СтраницаРаздела.Данные = ОбщегоНазначения.СкопироватьРекурсивно(ПоляРаздела2);
				СтраницаРаздела.Данные.П000020010501 = КБК;
				Если Ставка = Перечисления.НДФЛСтавки.Ставка03 Тогда
					 СтраницаРаздела.Данные.П000020010001 = 3
				ИначеЕсли Ставка = Перечисления.НДФЛСтавки.Ставка05 Тогда
					 СтраницаРаздела.Данные.П000020010001 = 5
				ИначеЕсли Ставка = Перечисления.НДФЛСтавки.Ставка06 Тогда
					 СтраницаРаздела.Данные.П000020010001 = 6
				ИначеЕсли Ставка = Перечисления.НДФЛСтавки.Ставка07 Тогда
					 СтраницаРаздела.Данные.П000020010001 = 7
				ИначеЕсли Ставка = Перечисления.НДФЛСтавки.Ставка09 Тогда
					 СтраницаРаздела.Данные.П000020010001 = 9
				ИначеЕсли Ставка = Перечисления.НДФЛСтавки.Ставка10 Тогда
					 СтраницаРаздела.Данные.П000020010001 = 10
				ИначеЕсли Ставка = Перечисления.НДФЛСтавки.Ставка12 Тогда
					 СтраницаРаздела.Данные.П000020010001 = 12
				ИначеЕсли Ставка = Перечисления.НДФЛСтавки.Ставка13 Тогда
					 СтраницаРаздела.Данные.П000020010001 = 13
				ИначеЕсли Ставка = Перечисления.НДФЛСтавки.Ставка15 Тогда
					 СтраницаРаздела.Данные.П000020010001 = 15
				ИначеЕсли Ставка = Перечисления.НДФЛСтавки.Ставка30 Тогда
					 СтраницаРаздела.Данные.П000020010001 = 30
				ИначеЕсли Ставка = Перечисления.НДФЛСтавки.Ставка35 Тогда
					 СтраницаРаздела.Данные.П000020010001 = 35
				Иначе
					
				КонецЕсли;
				СтраницаРаздела.ДанныеМногострочныхЧастей = Новый Структура();
			КонецЕсли;
			Для каждого СтрокаДанных Из СтрокиДоходов Цикл
				ЗаполнитьЗначенияСвойств(СтраницаРаздела.Данные, СтрокаДанных);
				Прервать;
			КонецЦикла;
			Для каждого СтрокаДанных Из СтрокиНалогов Цикл
				ЗаполнитьЗначенияСвойств(СтраницаРаздела.Данные, СтрокаДанных);
				Прервать;
			КонецЦикла;
			Для каждого СтрокаДанных Из СтрокиВычетов Цикл
				ЗаполнитьЗначенияСвойств(СтраницаРаздела.Данные, СтрокаДанных);
				Прервать;
			КонецЦикла;
			Для каждого СтрокаДанных Из СтрокиКоличества Цикл
				ЗаполнитьЗначенияСвойств(СтраницаРаздела.Данные, СтрокаДанных);
				Прервать;
			КонецЦикла;
			
		КонецЦикла;
	КонецЦикла;
	Если ДанныеРаздела2.Количество() = 0 Тогда
		СтраницаРаздела = ДанныеРаздела2.Добавить();
		СтраницаРаздела.Данные = ОбщегоНазначения.СкопироватьРекурсивно(ПоляРаздела2);
		СтраницаРаздела.ДанныеМногострочныхЧастей = Новый Структура();
	КонецЕсли;
	
	// Приложение 1
	Если ЗаполнятьПриложение1 Тогда
		Если ОписаниеТаблиц.Приложение1Налогоплательщики.Количество() > 0 Тогда
			
			СоответствиеСтавокДоходов = УчетНДФЛ.СоответствиеДоходовСтавкам();
			СоответствиеКодовСтран = Новый Соответствие;
			СоответствиеИменСтран = Новый Соответствие;
			СоответствиеДокументовУдостоверяющихЛичность = Новый Соответствие;
			СоответствиеКодовДоходов = Новый Соответствие;
			СоответствиеКодовФНССтатусамНДФЛ = Новый Соответствие;
			УчетНДФЛ.ПрочитатьКлассификаторыВСоответствия(СоответствиеКодовСтран, 
				СоответствиеИменСтран, 
				СоответствиеДокументовУдостоверяющихЛичность,
				СоответствиеКодовДоходов, 
				СоответствиеКодовФНССтатусамНДФЛ);
			
			СоответствиеСтавок = Новый Соответствие;
			СоответствиеСтавок[Перечисления.НДФЛСтавки.Ставка03] = 3;
			СоответствиеСтавок[Перечисления.НДФЛСтавки.Ставка05] = 5;
			СоответствиеСтавок[Перечисления.НДФЛСтавки.Ставка06] = 6;
			СоответствиеСтавок[Перечисления.НДФЛСтавки.Ставка07] = 7;
			СоответствиеСтавок[Перечисления.НДФЛСтавки.Ставка09] = 9;
			СоответствиеСтавок[Перечисления.НДФЛСтавки.Ставка10] = 10;
			СоответствиеСтавок[Перечисления.НДФЛСтавки.Ставка12] = 12;
			СоответствиеСтавок[Перечисления.НДФЛСтавки.Ставка13] = 13;
			СоответствиеСтавок[Перечисления.НДФЛСтавки.Ставка15] = 15;
			СоответствиеСтавок[Перечисления.НДФЛСтавки.Ставка30] = 30;
			СоответствиеСтавок[Перечисления.НДФЛСтавки.Ставка35] = 35;
			
			Если НомерКорректировки <> 99 Тогда
				Приложение1Итоги = ОписаниеТаблиц.Приложение1Итоги;
				Если Приложение1Итоги.Количество() > 100 Тогда
					Приложение1Итоги.Индексы.Добавить("ФизическоеЛицо");
				КонецЕсли;
				Приложение1Доходы = ОписаниеТаблиц.Приложение1Доходы;
				Если Приложение1Доходы.Количество() > 100 Тогда
					Приложение1Доходы.Индексы.Добавить("ФизическоеЛицо,Ставка");
				КонецЕсли;
				Приложение1Вычеты = ОписаниеТаблиц.Приложение1Вычеты;
				Если Приложение1Вычеты.Количество() > 100 Тогда
					Приложение1Вычеты.Индексы.Добавить("ФизическоеЛицо,Ставка");
				КонецЕсли;
				Приложение1УведомленияОВычетах = ОписаниеТаблиц.Приложение1УведомленияОВычетах;
				Если Приложение1УведомленияОВычетах.Количество() > 100 Тогда
					Приложение1УведомленияОВычетах.Индексы.Добавить("ФизическоеЛицо");
				КонецЕсли;
				ПоискПоФизлицу = Новый Структура("ФизическоеЛицо");
				ПоискПоФизлицуИСтавке = Новый Структура("ФизическоеЛицо,Ставка");
			КонецЕсли;
			
			Для каждого СтрокаДанных Из ОписаниеТаблиц.Приложение1Налогоплательщики Цикл
				
				СтраницаПриложение1 = ДанныеПриложение1.Добавить();
				СтраницаПриложение1.Данные = ОбщегоНазначения.СкопироватьРекурсивно(ПоляНалогоплательщика);
				СтраницаПриложение1.ДанныеМногострочныхЧастей = НовыеПустыеДанныеМногострочныхЧастей("П000П1М1");
				СтраницаПриложение1.Данные.П000П10000001 = НомерПервойСправки;
				НомерПервойСправки = НомерПервойСправки + 1;
				СтраницаПриложение1.Данные.П000П10000002 = "00";
				СтраницаПриложение1.Данные.П000П10000003 = СтрокаДанных.ИНН;
				СтраницаПриложение1.Данные.П000П10000004 = СокрЛП(СтрокаДанных.Фамилия);
				СтраницаПриложение1.Данные.П000П10000005 = СокрЛП(СтрокаДанных.Имя);
				СтраницаПриложение1.Данные.П000П10000006 = СокрЛП(СтрокаДанных.Отчество);
				Описание = СоответствиеКодовФНССтатусамНДФЛ.Получить(СтрокаДанных.СтатусНалогоплательщика);
				СтраницаПриложение1.Данные.П000П10000007 = ?(Описание = Неопределено, "", Описание.КодФНС_2015);
				СтраницаПриложение1.Данные.П000П10000008 = СтрокаДанных.ДатаРождения;
				СтраницаПриложение1.Данные.П000П10000009 = ФизическиеЛицаЗарплатаКадры.КодСтраныДляОтчетности(СоответствиеКодовСтран, СтрокаДанных.Гражданство, СтрокаДанных.СтранаВыдачиДокумента);
				Описание = СоответствиеДокументовУдостоверяющихЛичность.Получить(СтрокаДанных.ВидДокумента);
				СтраницаПриложение1.Данные.П000П10000010 = ?(Описание = Неопределено, "", Описание.КодМВД_2015);
				СтраницаПриложение1.Данные.П000П10000011 = СокрЛП(СтрокаДанных.СерияДокумента);
				СтраницаПриложение1.Данные.П000П10000012 = СокрЛП(СтрокаДанных.НомерДокумента);
				
				ВыводитьДоходы = НомерКорректировки <> 99;
				Если ВыводитьДоходы Тогда
					ПоискПоФизлицу.ФизическоеЛицо = СтрокаДанных.ФизическоеЛицо;
					ПоискПоФизлицуИСтавке.ФизическоеЛицо = СтрокаДанных.ФизическоеЛицо;
					СтрокиФизлица = Приложение1Итоги.НайтиСтроки(ПоискПоФизлицу);
					ВыводитьДоходы = СтрокиФизлица.Количество() > 0;
				КонецЕсли;
				Если ВыводитьДоходы Тогда
					Для каждого СтрокаИтоговПоСтавке Из СтрокиФизлица Цикл
						
						ПоискПоФизлицуИСтавке.Ставка = СтрокаИтоговПоСтавке.Ставка;
						СтраницаПоСтавке = СтраницаПриложение1.ДанныеМногострочныхЧастей.П000П1М1.Строки.Добавить();
						СтраницаПоСтавке.Данные = ОбщегоНазначения.СкопироватьРекурсивно(ПоляИтогов);
						ЗаполнитьЗначенияСвойств(СтраницаПоСтавке.Данные, СтрокаИтоговПоСтавке);
						СтраницаПоСтавке.ДанныеМногострочныхЧастей = НовыеПустыеДанныеМногострочныхЧастей("П000П1М2,П000П1М3,П000П1М4,П000П1М5");
						СтрокиДанных = Приложение1Вычеты.НайтиСтроки(ПоискПоФизлицуИСтавке);
						ВыводитьИмущественныйВычет = Ложь;
						ВыводитьСоциальныйВычет = Ложь;
						Если СтрокиДанных.Количество() > 0 Тогда
							Для каждого СтрокаДанных Из СтрокиДанных Цикл
								Если СтрокаДанных.П000П1М200002 <> 0 Тогда
									СтрокаПоСтавке = СтраницаПоСтавке.ДанныеМногострочныхЧастей.П000П1М2.Строки.Добавить();
									СтрокаПоСтавке.Данные = ОбщегоНазначения.СкопироватьРекурсивно(ПоляВычетов);
									ЗаполнитьЗначенияСвойств(СтрокаПоСтавке.Данные, СтрокаДанных);
									Если Не ВыводитьИмущественныйВычет Тогда
										ВыводитьИмущественныйВычет = СтрокаДанных.ГруппаВычета = Перечисления.ГруппыВычетовПоНДФЛ.Имущественные 
									КонецЕсли;
									Если Не ВыводитьСоциальныйВычет Тогда
										ВыводитьСоциальныйВычет = СтрокаДанных.ГруппаВычета = Перечисления.ГруппыВычетовПоНДФЛ.СоциальныеПоУведомлениюНО
									КонецЕсли;
								КонецЕсли;
							КонецЦикла;
						КонецЕсли;
						Если СтраницаПоСтавке.ДанныеМногострочныхЧастей.П000П1М2.Строки.Количество() = 0 Тогда
							СтраницаПоСтавке.ДанныеМногострочныхЧастей.П000П1М2.Строки.Добавить().Данные = ОбщегоНазначения.СкопироватьРекурсивно(ПоляВычетов);
						КонецЕсли;	
						
						СтрокиДанных = Приложение1УведомленияОВычетах.НайтиСтроки(ПоискПоФизлицу);
						Если СтрокиДанных.Количество() > 0 Тогда
							Для каждого СтрокаДанных Из СтрокиДанных Цикл
								Если ВыводитьИмущественныйВычет И СтрокаДанных.ГруппаВычета = Перечисления.ГруппыВычетовПоНДФЛ.Имущественные Тогда
									СтрокаПоСтавке = СтраницаПоСтавке.ДанныеМногострочныхЧастей.П000П1М3.Строки.Добавить();
									СтрокаПоСтавке.Данные = ОбщегоНазначения.СкопироватьРекурсивно(ПоляУведомленийОВычетах);
									ЗаполнитьЗначенияСвойств(СтрокаПоСтавке.Данные, СтрокаДанных);
									СтрокаПоСтавке.Данные.П000П1М300001 = "1"
								КонецЕсли;
								Если ВыводитьСоциальныйВычет И СтрокаДанных.ГруппаВычета = Перечисления.ГруппыВычетовПоНДФЛ.Социальные Тогда
									СтрокаПоСтавке = СтраницаПоСтавке.ДанныеМногострочныхЧастей.П000П1М3.Строки.Добавить();
									СтрокаПоСтавке.Данные = ОбщегоНазначения.СкопироватьРекурсивно(ПоляУведомленийОВычетах);
									ЗаполнитьЗначенияСвойств(СтрокаПоСтавке.Данные, СтрокаДанных);
									СтрокаПоСтавке.Данные.П000П1М300001 = "2"
								КонецЕсли;
								Если СтрокаИтоговПоСтавке.П000П1М100006 > 0 И СтрокаДанных.ГруппаВычета = Перечисления.ГруппыВычетовПоНДФЛ.ПустаяСсылка() Тогда
									СтрокаПоСтавке = СтраницаПоСтавке.ДанныеМногострочныхЧастей.П000П1М3.Строки.Добавить();
									СтрокаПоСтавке.Данные = ОбщегоНазначения.СкопироватьРекурсивно(ПоляУведомленийОВычетах);
									ЗаполнитьЗначенияСвойств(СтрокаПоСтавке.Данные, СтрокаДанных);
									СтрокаПоСтавке.Данные.П000П1М300001 = "3"
								КонецЕсли;
							КонецЦикла;
							Если СтраницаПоСтавке.ДанныеМногострочныхЧастей.П000П1М3.Строки.Количество() = 0 Тогда
								СтраницаПоСтавке.ДанныеМногострочныхЧастей.П000П1М3.Строки.Добавить().Данные = ОбщегоНазначения.СкопироватьРекурсивно(ПоляУведомленийОВычетах);
							КонецЕсли;
						Иначе
							СтраницаПоСтавке.ДанныеМногострочныхЧастей.П000П1М3.Строки.Добавить().Данные = ОбщегоНазначения.СкопироватьРекурсивно(ПоляУведомленийОВычетах);
						КонецЕсли;
						
						СтраницаПоСтавке.ДанныеМногострочныхЧастей.П000П1М4.Строки.Добавить().Данные = ОбщегоНазначения.СкопироватьРекурсивно(ПоляНеудержано);
						СтрокиДанных = Приложение1Доходы.Скопировать(Приложение1Доходы.НайтиСтроки(ПоискПоФизлицуИСтавке));
						Если СтрокиДанных.Количество() > 0 Тогда
							СтрокиДанных.Сортировать("Период,П000П1М500002");
							ТекущийКод = Неопределено;
							ТекущийПериод = Неопределено;
							ПредыдущаяСтрока = Неопределено; 
							СуммаДохода = 0;
							Для каждого СтрокаДанных Из СтрокиДанных Цикл
								Если ТекущийПериод <> СтрокаДанных.Период Или ТекущийКод <> СтрокаДанных.П000П1М500002 Тогда
									Если ПредыдущаяСтрока <> Неопределено Тогда
										ПредыдущаяСтрока.Данные.П000П1М500003 = СуммаДохода;
										Если ПредыдущаяСтрока.ДанныеМногострочныхЧастей.П000П1М6.Строки.Количество() = 0 Тогда
											СтрокаВычета = ПредыдущаяСтрока.ДанныеМногострочныхЧастей.П000П1М6.Строки.Добавить();
											СтрокаВычета.Данные = ОбщегоНазначения.СкопироватьРекурсивно(ПоляВычетовКДоходам);
											СтрокаВычета.Данные.П000П1М600004 = "";
										КонецЕсли;
									КонецЕсли;
									ТекущийКод = СтрокаДанных.П000П1М500002; 
									ТекущийПериод = СтрокаДанных.Период;
									СуммаДохода = 0;
									СтрокаПоСтавке = СтраницаПоСтавке.ДанныеМногострочныхЧастей.П000П1М5.Строки.Добавить();
									ПредыдущаяСтрока = СтрокаПоСтавке;  
									СтрокаПоСтавке.Данные = ОбщегоНазначения.СкопироватьРекурсивно(ПоляДоходов);
									ЗаполнитьЗначенияСвойств(СтрокаПоСтавке.Данные, СтрокаДанных);
									СтрокаПоСтавке.Данные.П000П1М500001 = Формат(СтрокаДанных.Период, "ДФ=MM");
									СтрокаПоСтавке.ДанныеМногострочныхЧастей = НовыеПустыеДанныеМногострочныхЧастей("П000П1М6");
								КонецЕсли;
								СуммаДохода = СуммаДохода + СтрокаДанных.П000П1М500003;
								Если ЗначениеЗаполнено(СтрокаДанных.П000П1М600004) Тогда
									СтрокаВычета = СтрокаПоСтавке.ДанныеМногострочныхЧастей.П000П1М6.Строки.Добавить();
									СтрокаВычета.Данные = ОбщегоНазначения.СкопироватьРекурсивно(ПоляВычетовКДоходам);
									ЗаполнитьЗначенияСвойств(СтрокаВычета.Данные, СтрокаДанных);
								КонецЕсли;
							КонецЦикла;
							СтрокаПоСтавке.Данные.П000П1М500003 = СуммаДохода;
							Если СтрокаПоСтавке.ДанныеМногострочныхЧастей.П000П1М6.Строки.Количество() = 0 Тогда
								СтрокаВычета = СтрокаПоСтавке.ДанныеМногострочныхЧастей.П000П1М6.Строки.Добавить();
								СтрокаВычета.Данные = ОбщегоНазначения.СкопироватьРекурсивно(ПоляВычетовКДоходам);
								СтрокаВычета.Данные.П000П1М600004 = "";
							КонецЕсли;
						Иначе
							СтрокаДоходов = СтраницаПоСтавке.ДанныеМногострочныхЧастей.П000П1М5.Строки.Добавить();
							СтрокаДоходов.Данные = ОбщегоНазначения.СкопироватьРекурсивно(ПоляДоходов);
							СтрокаДоходов.ДанныеМногострочныхЧастей = НовыеПустыеДанныеМногострочныхЧастей("П000П1М6");
							СтрокаДоходов.ДанныеМногострочныхЧастей.П000П1М6.Строки.Добавить().Данные = ОбщегоНазначения.СкопироватьРекурсивно(ПоляВычетовКДоходам);
						КонецЕсли;
						
					КонецЦикла; 
				Иначе
					СтраницаПоСтавке = СтраницаПриложение1.ДанныеМногострочныхЧастей.П000П1М1.Строки.Добавить();
					СтраницаПоСтавке.Данные = ОбщегоНазначения.СкопироватьРекурсивно(ПоляИтогов);
					СтраницаПоСтавке.ДанныеМногострочныхЧастей = НовыеПустыеДанныеМногострочныхЧастей("П000П1М2,П000П1М3,П000П1М4,П000П1М5");
					СтраницаПоСтавке.ДанныеМногострочныхЧастей.П000П1М2.Строки.Добавить().Данные = ОбщегоНазначения.СкопироватьРекурсивно(ПоляВычетов);
					СтраницаПоСтавке.ДанныеМногострочныхЧастей.П000П1М3.Строки.Добавить().Данные = ОбщегоНазначения.СкопироватьРекурсивно(ПоляУведомленийОВычетах);
					СтраницаПоСтавке.ДанныеМногострочныхЧастей.П000П1М4.Строки.Добавить().Данные = ОбщегоНазначения.СкопироватьРекурсивно(ПоляНеудержано);
					СтрокаДоходов = СтраницаПоСтавке.ДанныеМногострочныхЧастей.П000П1М5.Строки.Добавить();
					СтрокаДоходов.Данные = ОбщегоНазначения.СкопироватьРекурсивно(ПоляДоходов);
					СтрокаДоходов.ДанныеМногострочныхЧастей = НовыеПустыеДанныеМногострочныхЧастей("П000П1М6");
					СтрокаДоходов.ДанныеМногострочныхЧастей.П000П1М6.Строки.Добавить().Данные = ОбщегоНазначения.СкопироватьРекурсивно(ПоляВычетовКДоходам);
				КонецЕсли;
				
			КонецЦикла;
			
		Иначе 
			СтраницаПриложение1 = ДанныеПриложение1.Добавить();
			СтраницаПриложение1.Данные = ОбщегоНазначения.СкопироватьРекурсивно(ПоляНалогоплательщика);
			СтраницаПриложение1.ДанныеМногострочныхЧастей = НовыеПустыеДанныеМногострочныхЧастей("П000П1М1");
			СтраницаПоСтавке = СтраницаПриложение1.ДанныеМногострочныхЧастей.П000П1М1.Строки.Добавить();
			СтраницаПоСтавке.Данные = ОбщегоНазначения.СкопироватьРекурсивно(ПоляИтогов);
			СтраницаПоСтавке.ДанныеМногострочныхЧастей = НовыеПустыеДанныеМногострочныхЧастей("П000П1М2,П000П1М3,П000П1М4,П000П1М5");
			СтраницаПоСтавке.ДанныеМногострочныхЧастей.П000П1М2.Строки.Добавить().Данные = ОбщегоНазначения.СкопироватьРекурсивно(ПоляВычетов);
			СтраницаПоСтавке.ДанныеМногострочныхЧастей.П000П1М3.Строки.Добавить().Данные = ОбщегоНазначения.СкопироватьРекурсивно(ПоляУведомленийОВычетах);
			СтраницаПоСтавке.ДанныеМногострочныхЧастей.П000П1М4.Строки.Добавить().Данные = ОбщегоНазначения.СкопироватьРекурсивно(ПоляНеудержано);
			СтрокаДоходов = СтраницаПоСтавке.ДанныеМногострочныхЧастей.П000П1М5.Строки.Добавить();
			СтрокаДоходов.Данные = ОбщегоНазначения.СкопироватьРекурсивно(ПоляДоходов);
			СтрокаДоходов.ДанныеМногострочныхЧастей = НовыеПустыеДанныеМногострочныхЧастей("П000П1М6");
			СтрокаДоходов.ДанныеМногострочныхЧастей.П000П1М6.Строки.Добавить().Данные = ОбщегоНазначения.СкопироватьРекурсивно(ПоляВычетовКДоходам);
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры



//1АБ+  Беляев 28.05.2021 нормализуем ОписаниеТаблиц, чтобы нормально формировалась 6-НДФЛ
Процедура АБ_НДФЛ6Расшифровка_СкопироватьОписаниеТаблиц(НовоеОписаниеТаблиц,ОписаниеТаблиц)
	Раздел2Доходы = ОписаниеТаблиц.Раздел2Доходы.Скопировать();
	Раздел2Вычеты = ОписаниеТаблиц.Раздел2Вычеты.Скопировать();
	Раздел2Налоги = ОписаниеТаблиц.Раздел2Налоги.Скопировать();
	Раздел1Налоги = ОписаниеТаблиц.Раздел1Налоги.Скопировать();
	Раздел1Возвраты = ОписаниеТаблиц.Раздел1Возвраты.Скопировать();
	НовоеОписаниеТаблиц = Новый Структура("Раздел2Доходы,Раздел2Вычеты,Раздел2Налоги,Раздел1Налоги,Раздел1Возвраты",Раздел2Доходы,Раздел2Вычеты,Раздел2Налоги,Раздел1Налоги,Раздел1Возвраты);
	ОписаниеТаблиц.Раздел2Доходы.Свернуть("КБК,Ставка,СтавкаНалога","П000020011003,П000020011103,П000020011203,П000020011303");
	ОписаниеТаблиц.Раздел2Вычеты.Свернуть("КБК,Ставка,СтавкаНалога","П000020013003");
	
	//Здесь нужно свернуть так, чтобы не увеличивались поля излишне удержано / не удержано (см последний запрос по Раздел2Налоги)
	//ОписаниеТаблиц.Раздел2Налоги.Свернуть("КБК,Ставка,СтавкаНалога","П000020014003,П000020014103,П000020015003,П000020016003,П000020017003,П000020019003,П000020018003");
	Запрос = Новый Запрос;
	МВТ = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.Текст = "ВЫБРАТЬ
	|	ОписаниеТаблицРаздел2.КБК КАК КБК,
	|	ОписаниеТаблицРаздел2.Ставка КАК Ставка,
	|	ОписаниеТаблицРаздел2.СтавкаНалога КАК СтавкаНалога,
	|	ОписаниеТаблицРаздел2.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ОписаниеТаблицРаздел2.ДатаПолученияДохода КАК ДатаПолученияДохода,
	|	ОписаниеТаблицРаздел2.ДатаУдержания КАК ДатаУдержания,
	|	ОписаниеТаблицРаздел2.Регистратор КАК Регистратор,
	|	ОписаниеТаблицРаздел2.П000020014003 КАК П000020014003,
	|	ОписаниеТаблицРаздел2.П000020014103 КАК П000020014103,
	|	ОписаниеТаблицРаздел2.П000020015003 КАК П000020015003,
	|	ОписаниеТаблицРаздел2.П000020016003 КАК П000020016003,
	|	ОписаниеТаблицРаздел2.П000020017003 КАК П000020017003,
	|	ОписаниеТаблицРаздел2.П000020018003 КАК П000020018003,
	|	ОписаниеТаблицРаздел2.П000020019003 КАК П000020019003
	|ПОМЕСТИТЬ ВТ_ОписаниеТаблицРаздел2
	|ИЗ
	|	&ОписаниеТаблицРаздел2Налоги КАК ОписаниеТаблицРаздел2
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОписаниеТаблицРаздел2.КБК КАК КБК,
	|	ВТ_ОписаниеТаблицРаздел2.Ставка КАК Ставка,
	|	ВТ_ОписаниеТаблицРаздел2.СтавкаНалога КАК СтавкаНалога,
	|	ВТ_ОписаниеТаблицРаздел2.ФизическоеЛицо КАК ФизическоеЛицо,
	|	СУММА(ВТ_ОписаниеТаблицРаздел2.П000020014003) КАК П000020014003,
	|	СУММА(ВТ_ОписаниеТаблицРаздел2.П000020014103) КАК П000020014103,
	|	СУММА(ВТ_ОписаниеТаблицРаздел2.П000020015003) КАК П000020015003,
	|	СУММА(ВТ_ОписаниеТаблицРаздел2.П000020016003) КАК П000020016003,
	|	МАКСИМУМ(ВТ_ОписаниеТаблицРаздел2.П000020017003) КАК П000020017003,
	|	МАКСИМУМ(ВТ_ОписаниеТаблицРаздел2.П000020018003) КАК П000020018003,
	|	СУММА(ВТ_ОписаниеТаблицРаздел2.П000020019003) КАК П000020019003
	|ИЗ
	|	ВТ_ОписаниеТаблицРаздел2 КАК ВТ_ОписаниеТаблицРаздел2
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ОписаниеТаблицРаздел2.КБК,
	|	ВТ_ОписаниеТаблицРаздел2.СтавкаНалога,
	|	ВТ_ОписаниеТаблицРаздел2.Ставка,
	|	ВТ_ОписаниеТаблицРаздел2.ФизическоеЛицо";
	Запрос.УстановитьПараметр("ОписаниеТаблицРаздел2Налоги",ОписаниеТаблиц.Раздел2Налоги);
	ПромТаблица_Раздел2Налоги = Запрос.Выполнить().Выгрузить();
	ПромТаблица_Раздел2Налоги.Свернуть("КБК,Ставка,СтавкаНалога","П000020014003,П000020014103,П000020015003,П000020016003,П000020017003,П000020019003,П000020018003");
	ОписаниеТаблиц.Раздел2Налоги = ПромТаблица_Раздел2Налоги;
	
	ОписаниеТаблиц.Раздел1Налоги.Свернуть("КБК,СрокПеречисленияНалога,П00001М102101","П00001М102201");
	ОписаниеТаблиц.Раздел1Возвраты.Свернуть("КБК,ДатаВозврата,П00001М203101","П00001М203201");
КонецПроцедуры

//1АБ- Беляев 28.05.2021 нормализуем ОписаниеТаблиц, чтобы нормально формировалась 6-НДФЛ


&ИзменениеИКонтроль("РасчетПоказателей_6НДФЛ_2021Кв1")
Процедура АБ_РасчетПоказателей_6НДФЛ_2021Кв1(НачалоПериода, ОкончаниеПериода, ДатаПодписи, Организация, РегистрацияВНалоговомОргане, ОписаниеТаблиц, ПодробныеДанные, НомерКорректировки)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("ГоловнаяОрганизация", ЗарплатаКадры.ГоловнаяОрганизация(Организация));
	Запрос.УстановитьПараметр("РегистрацияВНалоговомОргане", РегистрацияВНалоговомОргане);
	Запрос.УстановитьПараметр("НачалоПредыдущегоГода", ДобавитьМесяц(НачалоПериода, -12));
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("НачалоГода", НачалоГода(НачалоПериода));
	Запрос.УстановитьПараметр("ОкончаниеПериода", ОкончаниеПериода);
	Запрос.УстановитьПараметр("ДатаПодписи", КонецДня(ДатаПодписи));
	Запрос.УстановитьПараметр("КБКсПревышения", "18210102080011000110");
	Запрос.УстановитьПараметр("ОсновнойКБК", "18210102010011000110");
	Запрос.УстановитьПараметр("КБКПоОблигациям", "18210102070011000110");
	Запрос.УстановитьПараметр("НачалоОтчетногоКвартала", НачалоКвартала(ОкончаниеПериода));
	Запрос.УстановитьПараметр("ОкончаниеПериодаОсмотраДоходовВычетов", ?(КонецГода(ОкончаниеПериода) = ОкончаниеПериода Или ЗначениеЗаполнено(НомерКорректировки), Макс(ДатаПодписи, ОкончаниеПериода), ОкончаниеПериода));
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ОплатаТруда) КАК КатегорияДохода,
	|	&ОсновнойКБК КАК КБК
	|ПОМЕСТИТЬ ВТСоответствиеКатегорийКБК
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ДоходВНатуральнойФормеОтТрудовойДеятельности),
	|	&ОсновнойКБК
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ПрочиеНатуральныеДоходы),
	|	&ОсновнойКБК
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ПрочиеДоходыВДенежнойФормеОтТрудовойДеятельности),
	|	&ОсновнойКБК
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.Дивиденды),
	|	&ОсновнойКБК
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ПрочиеДоходы),
	|	&ОсновнойКБК
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ДивидендыПоСтавке05),
	|	&ОсновнойКБК
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ДивидендыПоСтавке10),
	|	&ОсновнойКБК
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ДивидендыПоСтавке12),
	|	&ОсновнойКБК
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.АвторскиеРоялтиПоСтавке03),
	|	&ОсновнойКБК
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.АвторскиеРоялтиПроцентыПоСтавке05),
	|	&ОсновнойКБК
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.АвторскиеРоялтиПоСтавке06),
	|	&ОсновнойКБК
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.АвторскиеРоялтиПроцентыПоСтавке07),
	|	&ОсновнойКБК
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.АвторскиеРоялтиПроцентыПоСтавке10),
	|	&ОсновнойКБК
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.АвторскиеРоялтиПроцентыПоСтавке15),
	|	&ОсновнойКБК
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ДоходыПредыдущихРедакций),
	|	&ОсновнойКБК
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ПрочиеДоходыОтДолевогоУчастия),
	|	&ОсновнойКБК
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ПрочиеДоходыПоВыигрышам),
	|	&ОсновнойКБК
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ПрочиеДоходыЦБ),
	|	&ОсновнойКБК
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ПрочиеДоходыРЕПО),
	|	&ОсновнойКБК
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ПрочиеДоходыЗаймЦБ),
	|	&ОсновнойКБК
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ПрочиеДоходыИИС),
	|	&ОсновнойКБК
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ПрочиеДоходыПоСтавкеПункта11Статьи224НКРФ),
	|	&ОсновнойКБК
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ПрочиеДоходыПоОблигациям),
	|	&КБКПоОблигациям";
	Запрос.Выполнить();
	
	Если ОписаниеТаблиц.Свойство("Раздел1Налоги") Или ОписаниеТаблиц.Свойство("Раздел2Налоги") Или ОписаниеТаблиц.Свойство("Раздел1Возвраты") Или ОписаниеТаблиц.Свойство("Приложение1Итоги") Тогда
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.ФизическоеЛицо КАК ФизическоеЛицо,
		|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.КатегорияДохода КАК КатегорияДохода,
		|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Регистратор КАК Регистратор,
		|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.МесяцНалоговогоПериода КАК ДатаПолученияДохода,
		|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СтавкаНалогообложенияРезидента КАК СтавкаНалогообложенияРезидента,
		|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.ВариантУдержания КАК ВариантУдержания,
		|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.ВидДвижения КАК ВидДвижения,
		|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СрокПеречисления КАК СрокПеречисления,
		|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Сумма КАК Сумма,
		|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СуммаСПревышения КАК СуммаСПревышения,
		|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Период КАК Период,
		|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Период КАК ДатаУдержания,
		|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.ДокументОснование КАК ДокументОснование,
		|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.КрайнийСрокУплаты КАК КрайнийСрокУплаты,
		|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.РасчетМежрасчетногоПериода КАК РасчетМежрасчетногоПериода,
		|	СоответствиеКатегорийКБК.КБК КАК КБК,
		|	ВЫБОР
		|		КОГДА РасчетыНалогоплательщиковСБюджетомПоНДФЛ.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				И РасчетыНалогоплательщиковСБюджетомПоНДФЛ.КатегорияДохода = ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.Дивиденды)
		|			ТОГДА ВЫБОР
		|					КОГДА РасчетыНалогоплательщиковСБюджетомПоНДФЛ.НалогНаПрибыльДляДивидендов = 0
		|						ТОГДА 0
		|					КОГДА РасчетыНалогоплательщиковСБюджетомПоНДФЛ.НалогНаПрибыльДляДивидендов > 0
		|							И РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Сумма + РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СуммаСПревышения > 0
		|						ТОГДА ВЫБОР
		|								КОГДА РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Сумма + РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СуммаСПревышения >= РасчетыНалогоплательщиковСБюджетомПоНДФЛ.НалогНаПрибыльДляДивидендов
		|									ТОГДА РасчетыНалогоплательщиковСБюджетомПоНДФЛ.НалогНаПрибыльДляДивидендов
		|								ИНАЧЕ РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Сумма + РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СуммаСПревышения
		|							КОНЕЦ
		|					КОГДА РасчетыНалогоплательщиковСБюджетомПоНДФЛ.НалогНаПрибыльДляДивидендов < 0
		|							И РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Сумма + РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СуммаСПревышения < 0
		|						ТОГДА ВЫБОР
		|								КОГДА РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Сумма + РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СуммаСПревышения <= РасчетыНалогоплательщиковСБюджетомПоНДФЛ.НалогНаПрибыльДляДивидендов
		|									ТОГДА РасчетыНалогоплательщиковСБюджетомПоНДФЛ.НалогНаПрибыльДляДивидендов
		|								ИНАЧЕ РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Сумма + РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СуммаСПревышения
		|							КОНЕЦ
		|					ИНАЧЕ 0
		|				КОНЕЦ
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК НалогНаПрибыльДляДивидендов
		|ПОМЕСТИТЬ ВТНалоги
		|ИЗ
		|	РегистрНакопления.РасчетыНалогоплательщиковСБюджетомПоНДФЛ КАК РасчетыНалогоплательщиковСБюджетомПоНДФЛ
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСоответствиеКатегорийКБК КАК СоответствиеКатегорийКБК
		|		ПО РасчетыНалогоплательщиковСБюджетомПоНДФЛ.КатегорияДохода = СоответствиеКатегорийКБК.КатегорияДохода
		|ГДЕ
		|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Период МЕЖДУ &НачалоПредыдущегоГода И &ДатаПодписи
		|	И РасчетыНалогоплательщиковСБюджетомПоНДФЛ.РегистрацияВНалоговомОргане В(&РегистрацияВНалоговомОргане)
		|	И РасчетыНалогоплательщиковСБюджетомПоНДФЛ.ГоловнаяОрганизация = &ГоловнаяОрганизация
		|	И (РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Сумма <> 0
		|			ИЛИ РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СуммаСПревышения <> 0)";
		Запрос.Выполнить();
		
	КонецЕсли;
	
	Если ОписаниеТаблиц.Свойство("Раздел1Налоги") Тогда
		
		Если НачалоКвартала(ОкончаниеПериода) = '20210101' Тогда
			
			ТекстЗапроса =
			"ВЫБРАТЬ
			|	СтрокиНалогов.КБК КАК КБК,
			|	СтрокиНалогов.Регистратор КАК Регистратор,
			|	СтрокиНалогов.ФизическоеЛицо КАК ФизическоеЛицо,
			#Вставка
			|	СтрокиНалогов.ДатаПолученияДохода КАК ДатаПолученияДохода,
			|	СтрокиНалогов.ДатаУдержания КАК ДатаУдержания,
			#КонецВставки
			|	СтрокиНалогов.КрайнийСрокУплаты КАК СрокПеречисленияНалога,
			|	СтрокиНалогов.КрайнийСрокУплаты КАК П00001М102101,
			|	СтрокиНалогов.Сумма КАК П00001М102201
			|ПОМЕСТИТЬ ВТСтрокиНалогов
			|ИЗ
			|	ВТНалоги КАК СтрокиНалогов
			|ГДЕ
			|	СтрокиНалогов.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.Удержано)
			|	И СтрокиНалогов.ДатаУдержания МЕЖДУ &НачалоОтчетногоКвартала И &ОкончаниеПериода
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	&КБКсПревышения,
			|	СтрокиНалогов.Регистратор,
			|	СтрокиНалогов.ФизическоеЛицо,
			#Вставка
			|	СтрокиНалогов.ДатаПолученияДохода КАК ДатаПолученияДохода,
			|	СтрокиНалогов.ДатаУдержания КАК ДатаУдержания,
			#КонецВставки
			|	СтрокиНалогов.КрайнийСрокУплаты,
			|	СтрокиНалогов.КрайнийСрокУплаты,
			|	СтрокиНалогов.СуммаСПревышения
			|ИЗ
			|	ВТНалоги КАК СтрокиНалогов
			|ГДЕ
			|	СтрокиНалогов.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.Удержано)
			|	И СтрокиНалогов.ДатаУдержания МЕЖДУ &НачалоОтчетногоКвартала И &ОкончаниеПериода
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	СтрокиНалогов.КБК,
			|	СтрокиНалогов.Регистратор,
			|	СтрокиНалогов.ФизическоеЛицо,
			#Вставка
			|	СтрокиНалогов.ДатаПолученияДохода КАК ДатаПолученияДохода,
			|	СтрокиНалогов.ДатаУдержания КАК ДатаУдержания,
			#КонецВставки
			|	СтрокиНалогов.КрайнийСрокУплаты,
			|	СтрокиНалогов.КрайнийСрокУплаты,
			|	СтрокиНалогов.Сумма
			|ИЗ
			|	ВТНалоги КАК СтрокиНалогов
			|ГДЕ
			|	СтрокиНалогов.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.Удержано)
			|	И СтрокиНалогов.КрайнийСрокУплаты >= ДАТАВРЕМЯ(2021, 1, 1, 0, 0, 0)
			|	И СтрокиНалогов.ДатаУдержания < ДАТАВРЕМЯ(2021, 1, 1, 0, 0, 0)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	НалогиПоДатам.КБК КАК КБК,
			|	НалогиПоДатам.Регистратор КАК Регистратор,
			|	НалогиПоДатам.ФизическоеЛицо КАК ФизическоеЛицо,
			#Вставка
			|	НалогиПоДатам.ДатаПолученияДохода Как ДатаПолученияДохода,
			|	НалогиПоДатам.ДатаУдержания Как ДатаУдержания,
			#КонецВставки
			|	НалогиПоДатам.СрокПеречисленияНалога КАК СрокПеречисленияНалога,
			|	НалогиПоДатам.П00001М102101 КАК П00001М102101,
			|	СУММА(НалогиПоДатам.П00001М102201) КАК П00001М102201
			|ИЗ
			|	ВТСтрокиНалогов КАК НалогиПоДатам
			|
			|СГРУППИРОВАТЬ ПО
			|	НалогиПоДатам.КБК,
			|	НалогиПоДатам.Регистратор,
			|	НалогиПоДатам.ФизическоеЛицо,
			#Вставка
			|	НалогиПоДатам.ДатаПолученияДохода,
			|	НалогиПоДатам.ДатаУдержания,
			#КонецВставки
			|	НалогиПоДатам.СрокПеречисленияНалога,
			|	НалогиПоДатам.П00001М102101
			#Удаление
			|
			|ИМЕЮЩИЕ
			|	СУММА(НалогиПоДатам.П00001М102201) > 0
			#КонецУдаления
			#Вставка
			|ИМЕЮЩИЕ
			|	СУММА(НалогиПоДатам.П00001М102201) <> 0
			#КонецВставки
			|
			|УПОРЯДОЧИТЬ ПО
			|	СрокПеречисленияНалога";
			
		Иначе
			ТекстЗапроса =
			"ВЫБРАТЬ
			|	НалогиПоДатам.КБК КАК КБК,
			|	НалогиПоДатам.Регистратор КАК Регистратор,
			|	НалогиПоДатам.ФизическоеЛицо КАК ФизическоеЛицо,
			#Вставка
			|	НалогиПоДатам.ДатаПолученияДохода КАК ДатаПолученияДохода,
			|	НалогиПоДатам.ДатаУдержания Как ДатаУдержания,
			#КонецВставки
			|	НалогиПоДатам.КрайнийСрокУплаты КАК СрокПеречисленияНалога,
			|	НалогиПоДатам.КрайнийСрокУплаты КАК П00001М102101,
			|	СУММА(НалогиПоДатам.Сумма) КАК П00001М102201
			|ИЗ
			|	ВТНалоги КАК НалогиПоДатам
			|ГДЕ
			|	НалогиПоДатам.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.Удержано)
			|	И НалогиПоДатам.ДатаУдержания МЕЖДУ &НачалоОтчетногоКвартала И &ОкончаниеПериода
			|
			|СГРУППИРОВАТЬ ПО
			|	НалогиПоДатам.КБК,
			|	НалогиПоДатам.Регистратор,
			|	НалогиПоДатам.ФизическоеЛицо,
			#Вставка
			|	НалогиПоДатам.ДатаПолученияДохода,
			|	НалогиПоДатам.ДатаУдержания,
			#КонецВставки
			|	НалогиПоДатам.КрайнийСрокУплаты,
			|	НалогиПоДатам.КрайнийСрокУплаты
			|
			#Удаление
			|ИМЕЮЩИЕ
			|	СУММА(НалогиПоДатам.Сумма) > 0
			#КонецУдаления
			#Вставка
			|ИМЕЮЩИЕ
			|	СУММА(НалогиПоДатам.Сумма) <> 0
			#КонецВставки
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	&КБКсПревышения,
			|	НалогиПоДатам.Регистратор,
			|	НалогиПоДатам.ФизическоеЛицо,
			#Вставка
			|	НалогиПоДатам.ДатаПолученияДохода,
			|	НалогиПоДатам.ДатаУдержания,
			#КонецВставки
			|	НалогиПоДатам.КрайнийСрокУплаты,
			|	НалогиПоДатам.КрайнийСрокУплаты,
			|	СУММА(НалогиПоДатам.СуммаСПревышения)
			|ИЗ
			|	ВТНалоги КАК НалогиПоДатам
			|ГДЕ
			|	НалогиПоДатам.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.Удержано)
			|	И НалогиПоДатам.ДатаУдержания МЕЖДУ &НачалоОтчетногоКвартала И &ОкончаниеПериода
			|
			|СГРУППИРОВАТЬ ПО
			|	НалогиПоДатам.Регистратор,
			|	НалогиПоДатам.ФизическоеЛицо,
			#Вставка
			|	НалогиПоДатам.ДатаПолученияДохода,
			|	НалогиПоДатам.ДатаУдержания,
			#КонецВставки
			|	НалогиПоДатам.КрайнийСрокУплаты,
			|	НалогиПоДатам.КрайнийСрокУплаты
			|
			#Удаление
			|ИМЕЮЩИЕ
			|	СУММА(НалогиПоДатам.СуммаСПревышения) > 0
			#КонецУдаления
			#Вставка
			|ИМЕЮЩИЕ
			|	СУММА(НалогиПоДатам.СуммаСПревышения) <> 0
			#КонецВставки
			|
			|УПОРЯДОЧИТЬ ПО
			|	СрокПеречисленияНалога";
			
		КонецЕсли;
		#Удаление
		МассивПолей = Новый Массив;
		Если Не ПодробныеДанные Тогда
			МассивПолей.Добавить("ФизическоеЛицо");
			МассивПолей.Добавить("Регистратор");
		КонецЕсли;
		Запрос.Текст = УдалитьПоляРасшифровкиИзЗапроса(ТекстЗапроса, МассивПолей, "НалогиПоДатам");
		#КонецУдаления
		#Вставка
		Запрос.Текст = ТекстЗапроса;
		#КонецВставки
		ОписаниеТаблиц.Раздел1Налоги = Запрос.Выполнить().Выгрузить();
		
	КонецЕсли;
	
	Если ОписаниеТаблиц.Свойство("Раздел1Возвраты") Тогда
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	НалогиПоДатам.КБК КАК КБК,
		|	НалогиПоДатам.Регистратор КАК Регистратор,
		|	НалогиПоДатам.ФизическоеЛицо КАК ФизическоеЛицо,
		#Вставка
		|	НалогиПоДатам.ДатаПолученияДохода Как ДатаПолученияДохода,
		#КонецВставки
		|	НалогиПоДатам.Период КАК ДатаВозврата,
		|	НалогиПоДатам.Период КАК П00001М203101,
		|	-СУММА(НалогиПоДатам.Сумма) КАК П00001М203201
		|ИЗ
		|	ВТНалоги КАК НалогиПоДатам
		|ГДЕ
		|	НалогиПоДатам.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.ВозвращеноНалоговымАгентом)
		|	И НалогиПоДатам.Период МЕЖДУ &НачалоОтчетногоКвартала И &ОкончаниеПериода
		|
		|СГРУППИРОВАТЬ ПО
		|	НалогиПоДатам.КБК,
		|	НалогиПоДатам.Регистратор,
		|	НалогиПоДатам.ФизическоеЛицо,
		#Вставка
		|	НалогиПоДатам.ДатаПолученияДохода,
		#КонецВставки
		|	НалогиПоДатам.Период,
		|	НалогиПоДатам.Период
		|
		|ИМЕЮЩИЕ
		|	СУММА(НалогиПоДатам.Сумма) < 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	&КБКсПревышения,
		|	НалогиПоДатам.Регистратор,
		|	НалогиПоДатам.ФизическоеЛицо,
		#Вставка
		|	НалогиПоДатам.ДатаПолученияДохода,
		#КонецВставки
		|	НалогиПоДатам.Период,
		|	НалогиПоДатам.Период,
		|	-СУММА(НалогиПоДатам.СуммаСПревышения)
		|ИЗ
		|	ВТНалоги КАК НалогиПоДатам
		|ГДЕ
		|	НалогиПоДатам.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.ВозвращеноНалоговымАгентом)
		|	И НалогиПоДатам.Период МЕЖДУ &НачалоОтчетногоКвартала И &ОкончаниеПериода
		|
		|СГРУППИРОВАТЬ ПО
		|	НалогиПоДатам.Регистратор,
		|	НалогиПоДатам.ФизическоеЛицо,
		#Вставка
		|	НалогиПоДатам.ДатаПолученияДохода,
		#КонецВставки
		|	НалогиПоДатам.Период,
		|	НалогиПоДатам.Период
		|
		|ИМЕЮЩИЕ
		|	СУММА(НалогиПоДатам.СуммаСПревышения) < 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаВозврата";
		
		#Удаление
		МассивПолей = Новый Массив;
		Если Не ПодробныеДанные Тогда
			МассивПолей.Добавить("ФизическоеЛицо");
			МассивПолей.Добавить("Регистратор");
		КонецЕсли;
		Запрос.Текст = УдалитьПоляРасшифровкиИзЗапроса(ТекстЗапроса, МассивПолей, "НалогиПоДатам");
		#КонецУдаления
		#Вставка
		Запрос.Текст = ТекстЗапроса;
		#КонецВставки
		ОписаниеТаблиц.Раздел1Возвраты = Запрос.Выполнить().Выгрузить();
		
	КонецЕсли;
	
	Если ОписаниеТаблиц.Свойство("Раздел2Доходы") Или ОписаниеТаблиц.Свойство("Раздел2Вычеты") Или ОписаниеТаблиц.Свойство("КоличествоПолучателейДохода")
		Или ОписаниеТаблиц.Свойство("Приложение1Доходы") Или ОписаниеТаблиц.Свойство("Приложение1Вычеты") Тогда
		
		ПараметрыРасчетаНДФЛПоПрогрессивнойШкале = УчетНДФЛ.ПараметрыРасчетаНДФЛПоПрогрессивнойШкале();
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	СведенияОДоходахНДФЛ.ФизическоеЛицо КАК ФизическоеЛицо
		|ПОМЕСТИТЬ ВТФизическиеЛицаОтчета
		|ИЗ
		|	РегистрНакопления.СведенияОДоходахНДФЛ КАК СведенияОДоходахНДФЛ
		|ГДЕ
		|	СведенияОДоходахНДФЛ.Период МЕЖДУ &НачалоПредыдущегоГода И &ДатаПодписи
		|	И (СведенияОДоходахНДФЛ.Период МЕЖДУ &НачалоПредыдущегоГода И &ОкончаниеПериодаОсмотраДоходовВычетов
		|			ИЛИ СведенияОДоходахНДФЛ.Регистратор <> СведенияОДоходахНДФЛ.ДокументОснование)
		|	И СведенияОДоходахНДФЛ.МесяцНалоговогоПериода МЕЖДУ &НачалоПериода И &ОкончаниеПериода
		|	И СведенияОДоходахНДФЛ.РегистрацияВНалоговомОргане В(&РегистрацияВНалоговомОргане)
		|	И &УсловиеОблагаемостиУНалоговогоАгента
		|	И СведенияОДоходахНДФЛ.ГоловнаяОрганизация = &ГоловнаяОрганизация
		|
		|СГРУППИРОВАТЬ ПО
		|	СведенияОДоходахНДФЛ.ФизическоеЛицо
		|
		|ИМЕЮЩИЕ
		|	(СУММА(СведенияОДоходахНДФЛ.СуммаДохода) <> 0
		|		ИЛИ СУММА(СведенияОДоходахНДФЛ.СуммаВычета) <> 0)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СведенияОДоходахНДФЛ.ФизическоеЛицо КАК ФизическоеЛицо,
		|	СведенияОДоходахНДФЛ.ДатаПолученияДохода КАК Период,
		|	СведенияОДоходахНДФЛ.КатегорияДохода КАК КатегорияДохода,
		|	СведенияОДоходахНДФЛ.КодДохода.СтавкаНалогообложенияРезидента КАК СтавкаНалогообложенияРезидента
		|ПОМЕСТИТЬ ВТСтрокиДоходов
		|ИЗ
		|	РегистрНакопления.СведенияОДоходахНДФЛ КАК СведенияОДоходахНДФЛ
		|ГДЕ
		|	СведенияОДоходахНДФЛ.Период МЕЖДУ &НачалоПредыдущегоГода И &ДатаПодписи
		|	И (СведенияОДоходахНДФЛ.Период МЕЖДУ &НачалоПредыдущегоГода И &ОкончаниеПериодаОсмотраДоходовВычетов
		|			ИЛИ СведенияОДоходахНДФЛ.Регистратор <> СведенияОДоходахНДФЛ.ДокументОснование)
		|	И СведенияОДоходахНДФЛ.МесяцНалоговогоПериода МЕЖДУ &НачалоПериода И &ОкончаниеПериода
		|	И &УсловиеОблагаемостиУНалоговогоАгента
		|	И СведенияОДоходахНДФЛ.ГоловнаяОрганизация = &ГоловнаяОрганизация
		|	И СведенияОДоходахНДФЛ.ФизическоеЛицо В
		|			(ВЫБРАТЬ
		|				ФизическиеЛицаОтчета.ФизическоеЛицо КАК ФизическоеЛицо
		|			ИЗ
		|				ВТФизическиеЛицаОтчета КАК ФизическиеЛицаОтчета)
		|
		|СГРУППИРОВАТЬ ПО
		|	СведенияОДоходахНДФЛ.ФизическоеЛицо,
		|	СведенияОДоходахНДФЛ.ДатаПолученияДохода,
		|	СведенияОДоходахНДФЛ.КатегорияДохода,
		|	СведенияОДоходахНДФЛ.КодДохода.СтавкаНалогообложенияРезидента
		|
		|ИМЕЮЩИЕ
		|	(СУММА(СведенияОДоходахНДФЛ.СуммаДохода) <> 0
		|		ИЛИ СУММА(СведенияОДоходахНДФЛ.СуммаВычета) <> 0)";
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОблагаемостиУНалоговогоАгента", УчетНДФЛ.УсловиеОблагаемостиУНалоговогоАгента());
		Запрос.Выполнить();
		
		УчетНДФЛ.СоздатьВТСтавкаНДФЛПоСтавкеРезидента(Запрос.МенеджерВременныхТаблиц, "ВТСтрокиДоходов", "УчитыватьИзмененияСтатусаДляОтчетности", ОкончаниеПериода);
		
		Запрос.УстановитьПараметр("ОсновнаяНалоговаяБаза", Перечисления.КатегорииДоходовНДФЛ.ОсновнаяНалоговаяБаза());
		Запрос.УстановитьПараметр("Предел", ПараметрыРасчетаНДФЛПоПрогрессивнойШкале.Предел);
		Запрос.УстановитьПараметр("СтавкаСПревышения", ПараметрыРасчетаНДФЛПоПрогрессивнойШкале.Ставка);
		Запрос.УстановитьПараметр("СтавкаЧисломСПревышения", ПараметрыРасчетаНДФЛПоПрогрессивнойШкале.СтавкаЧислом * 100);
		Запрос.УстановитьПараметр("ГодПериода", Год(ОкончаниеПериода));
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	СтавкаНДФЛПоСтавкеРезидента.СтавкаЧислом * 100 КАК СтавкаНалога,
		|	СтавкаНДФЛПоСтавкеРезидента.СтавкаНДФЛ КАК Ставка,
		|	ВЫБОР
		|		КОГДА СтавкаНДФЛПоСтавкеРезидента.СтавкаНДФЛ <> ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ПустаяСсылка)
		|		КОГДА СведенияОДоходахНДФЛ.КатегорияДохода = ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ПрочиеДоходыПоСтавкеПункта11Статьи224НКРФ)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ПустаяСсылка)
		|		КОГДА СведенияОДоходахНДФЛ.КатегорияДохода В (&ОсновнаяНалоговаяБаза)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ОплатаТруда)
		|		ИНАЧЕ СведенияОДоходахНДФЛ.КатегорияДохода
		|	КОНЕЦ КАК НалоговаяБаза,
		|	СведенияОДоходахНДФЛ.ФизическоеЛицо КАК ФизическоеЛицо,
		|	СведенияОДоходахНДФЛ.ДатаПолученияДохода КАК Период,
		|	СведенияОДоходахНДФЛ.КатегорияДохода КАК КатегорияДохода,
		|	СведенияОДоходахНДФЛ.КодДохода КАК КодДохода,
		|	СведенияОДоходахНДФЛ.КодДохода.СтавкаНалогообложенияРезидента КАК СтавкаНалогообложенияРезидента,
		|	СУММА(СведенияОДоходахНДФЛ.СуммаДохода) КАК СуммаДохода,
		|	СведенияОДоходахНДФЛ.Регистратор КАК Регистратор,
		|	СведенияОДоходахНДФЛ.Начисление КАК Начисление,
		|	ВЫБОР
		|		КОГДА СведенияОДоходахНДФЛ.СуммаВычета = 0
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыВычетовНДФЛ.ПустаяСсылка)
		|		ИНАЧЕ СведенияОДоходахНДФЛ.КодВычета
		|	КОНЕЦ КАК КодВычета,
		|	СУММА(СведенияОДоходахНДФЛ.СуммаВычета) КАК СуммаВычета,
		|	СведенияОДоходахНДФЛ.ИсточникДоходаЗаПределамиРФ КАК ИсточникДоходаЗаПределамиРФ,
		|	СоответствиеКатегорийКБК.КБК КАК КБК,
		|	СведенияОДоходахНДФЛ.РегистрацияВНалоговомОргане В (&РегистрацияВНалоговомОргане) КАК ДанныеДляОтчета,
		|	СведенияОДоходахНДФЛ.СтрокаРаздела2Расчета6НДФЛ КАК СтрокаРаздела2
		|ПОМЕСТИТЬ ВТДоходыПоСтавкам
		|ИЗ
		|	РегистрНакопления.СведенияОДоходахНДФЛ КАК СведенияОДоходахНДФЛ
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСоответствиеКатегорийКБК КАК СоответствиеКатегорийКБК
		|		ПО СведенияОДоходахНДФЛ.КатегорияДохода = СоответствиеКатегорийКБК.КатегорияДохода
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтавкаНДФЛПоСтавкеРезидента КАК СтавкаНДФЛПоСтавкеРезидента
		|		ПО СведенияОДоходахНДФЛ.ФизическоеЛицо = СтавкаНДФЛПоСтавкеРезидента.ФизическоеЛицо
		|			И СведенияОДоходахНДФЛ.ДатаПолученияДохода = СтавкаНДФЛПоСтавкеРезидента.Период
		|			И СведенияОДоходахНДФЛ.КодДохода.СтавкаНалогообложенияРезидента = СтавкаНДФЛПоСтавкеРезидента.СтавкаНалогообложенияРезидента
		|			И СведенияОДоходахНДФЛ.КатегорияДохода = СтавкаНДФЛПоСтавкеРезидента.КатегорияДохода
		|ГДЕ
		|	СведенияОДоходахНДФЛ.Период МЕЖДУ &НачалоПредыдущегоГода И &ДатаПодписи
		|	И СведенияОДоходахНДФЛ.ФизическоеЛицо В
		|			(ВЫБРАТЬ
		|				ФизическиеЛицаОтчета.ФизическоеЛицо КАК ФизическоеЛицо
		|			ИЗ
		|				ВТФизическиеЛицаОтчета КАК ФизическиеЛицаОтчета)
		|	И (СведенияОДоходахНДФЛ.Период МЕЖДУ &НачалоПредыдущегоГода И &ОкончаниеПериодаОсмотраДоходовВычетов
		|			ИЛИ СведенияОДоходахНДФЛ.Регистратор <> СведенияОДоходахНДФЛ.ДокументОснование)
		|	И СведенияОДоходахНДФЛ.МесяцНалоговогоПериода МЕЖДУ &НачалоПериода И &ОкончаниеПериода
		|	И &УсловиеОблагаемостиУНалоговогоАгента
		|	И СведенияОДоходахНДФЛ.ГоловнаяОрганизация = &ГоловнаяОрганизация
		|	И (СведенияОДоходахНДФЛ.СуммаДохода <> 0
		|			ИЛИ СведенияОДоходахНДФЛ.СуммаВычета <> 0)
		|	И (НЕ СведенияОДоходахНДФЛ.ИсточникДоходаЗаПределамиРФ
		|			ИЛИ СтавкаНДФЛПоСтавкеРезидента.Статус = ЗНАЧЕНИЕ(Справочник.СтатусыНалогоплательщиковПоНДФЛ.Резидент))
		|
		|СГРУППИРОВАТЬ ПО
		|	СтавкаНДФЛПоСтавкеРезидента.СтавкаЧислом,
		|	СтавкаНДФЛПоСтавкеРезидента.СтавкаНДФЛ,
		|	СведенияОДоходахНДФЛ.ФизическоеЛицо,
		|	СведенияОДоходахНДФЛ.ДатаПолученияДохода,
		|	СведенияОДоходахНДФЛ.КатегорияДохода,
		|	СведенияОДоходахНДФЛ.КодДохода,
		|	СведенияОДоходахНДФЛ.КодДохода.СтавкаНалогообложенияРезидента,
		|	СведенияОДоходахНДФЛ.Регистратор,
		|	СведенияОДоходахНДФЛ.Начисление,
		|	СведенияОДоходахНДФЛ.ИсточникДоходаЗаПределамиРФ,
		|	СоответствиеКатегорийКБК.КБК,
		|	СведенияОДоходахНДФЛ.РегистрацияВНалоговомОргане В (&РегистрацияВНалоговомОргане),
		|	ВЫБОР
		|		КОГДА СведенияОДоходахНДФЛ.СуммаВычета = 0
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыВычетовНДФЛ.ПустаяСсылка)
		|		ИНАЧЕ СведенияОДоходахНДФЛ.КодВычета
		|	КОНЕЦ,
		|	СведенияОДоходахНДФЛ.СтрокаРаздела2Расчета6НДФЛ
		|
		|ИМЕЮЩИЕ
		|	(СУММА(СведенияОДоходахНДФЛ.СуммаДохода) <> 0
		|		ИЛИ СУММА(СведенияОДоходахНДФЛ.СуммаВычета) <> 0)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ.Регистратор КАК Регистратор,
		|	ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ.КодВычета КАК КодВычета,
		|	ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ.Сумма КАК Сумма,
		|	ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ.РегистрацияВНалоговомОргане В (&РегистрацияВНалоговомОргане) КАК ДанныеДляОтчета
		|ПОМЕСТИТЬ ВТСтандартныеИмущественныеВычеты
		|ИЗ
		|	РегистрНакопления.ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ КАК ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ
		|ГДЕ
		|	ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ.Период МЕЖДУ &НачалоПредыдущегоГода И &ОкончаниеПериодаОсмотраДоходовВычетов
		|	И ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ.МесяцНалоговогоПериода МЕЖДУ &НачалоПериода И &ОкончаниеПериода
		|	И ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ.ГоловнаяОрганизация = &ГоловнаяОрганизация
		|	И ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ.Сумма <> 0
		|	И ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ.ФизическоеЛицо В
		|			(ВЫБРАТЬ
		|				ФизическиеЛицаОтчета.ФизическоеЛицо КАК ФизическоеЛицо
		|			ИЗ
		|				ВТФизическиеЛицаОтчета КАК ФизическиеЛицаОтчета)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ИмущественныеВычетыНДФЛ.Регистратор,
		|	ИмущественныеВычетыНДФЛ.ФизическоеЛицо,
		|	ИмущественныеВычетыНДФЛ.КодВычета,
		|	ИмущественныеВычетыНДФЛ.Сумма,
		|	ИмущественныеВычетыНДФЛ.Период,
		|	ИмущественныеВычетыНДФЛ.РегистрацияВНалоговомОргане В (&РегистрацияВНалоговомОргане)
		|ИЗ
		|	РегистрНакопления.ИмущественныеВычетыНДФЛ КАК ИмущественныеВычетыНДФЛ
		|ГДЕ
		|	ИмущественныеВычетыНДФЛ.Период МЕЖДУ &НачалоПредыдущегоГода И &ОкончаниеПериода
		|	И ИмущественныеВычетыНДФЛ.МесяцРегистрации <= &ОкончаниеПериодаОсмотраДоходовВычетов
		|	И ИмущественныеВычетыНДФЛ.ГоловнаяОрганизация = &ГоловнаяОрганизация
		|	И ИмущественныеВычетыНДФЛ.Сумма <> 0
		|	И ИмущественныеВычетыНДФЛ.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|	И ИмущественныеВычетыНДФЛ.Год = &ГодПериода
		|	И ИмущественныеВычетыНДФЛ.ФизическоеЛицо В
		|			(ВЫБРАТЬ
		|				ФизическиеЛицаОтчета.ФизическоеЛицо КАК ФизическоеЛицо
		|			ИЗ
		|				ВТФизическиеЛицаОтчета КАК ФизическиеЛицаОтчета)";
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОблагаемостиУНалоговогоАгента", УчетНДФЛ.УсловиеОблагаемостиУНалоговогоАгента());
		УстановитьПривилегированныйРежим(Истина);
		Запрос.Выполнить();
		УстановитьПривилегированныйРежим(Ложь);
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	База.ФизическоеЛицо КАК ФизическоеЛицо,
		|	База.НалоговаяБаза КАК НалоговаяБаза
		|ПОМЕСТИТЬ ВТСотрудникиСПревышением
		|ИЗ
		|	(ВЫБРАТЬ
		|		ДоходыПоСтавкам.ФизическоеЛицо КАК ФизическоеЛицо,
		|		ДоходыПоСтавкам.НалоговаяБаза КАК НалоговаяБаза,
		|		ДоходыПоСтавкам.СуммаДохода - ДоходыПоСтавкам.СуммаВычета КАК ОблагаемаяБаза
		|	ИЗ
		|		ВТДоходыПоСтавкам КАК ДоходыПоСтавкам
		|	ГДЕ
		|		ДоходыПоСтавкам.НалоговаяБаза <> ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ПустаяСсылка)
		|
		|	ОБЪЕДИНИТЬ ВСЕ
		|
		|	ВЫБРАТЬ
		|		СтандартныеИмущественныеВычеты.ФизическоеЛицо,
		|		ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ОплатаТруда),
		|		-СтандартныеИмущественныеВычеты.Сумма
		|	ИЗ
		|		ВТСтандартныеИмущественныеВычеты КАК СтандартныеИмущественныеВычеты) КАК База
		|
		|СГРУППИРОВАТЬ ПО
		|	База.ФизическоеЛицо,
		|	База.НалоговаяБаза
		|
		|ИМЕЮЩИЕ
		|	СУММА(База.ОблагаемаяБаза) > &Предел";
		
		Если Запрос.Выполнить().Выгрузить()[0].Количество > 0 Тогда
			
			Запрос.Текст =
			"ВЫБРАТЬ
			|	СведенияОДоходахНДФЛ.ФизическоеЛицо КАК ФизическоеЛицо,
			|	СведенияОДоходахНДФЛ.Период КАК Период,
			|	НАЧАЛОПЕРИОДА(СведенияОДоходахНДФЛ.Период, МЕСЯЦ) КАК НачалоМесяца,
			|	СведенияОДоходахНДФЛ.НалоговаяБаза КАК НалоговаяБаза,
			|	СУММА(СведенияОДоходахНДФЛ.СуммаДохода - СведенияОДоходахНДФЛ.СуммаВычета) КАК ОблагаемыйДоход,
			|	0 КАК ОблагаемыйДоходСНачалаГода,
			|	ЛОЖЬ КАК ЭтоДеньПревышенияПредела,
			|	ЛОЖЬ КАК ПределПревышен
			|ИЗ
			|	ВТДоходыПоСтавкам КАК СведенияОДоходахНДФЛ
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСотрудникиСПревышением КАК СотрудникиСПревышением
			|		ПО СведенияОДоходахНДФЛ.ФизическоеЛицо = СотрудникиСПревышением.ФизическоеЛицо
			|			И СведенияОДоходахНДФЛ.НалоговаяБаза = СотрудникиСПревышением.НалоговаяБаза
			|
			|СГРУППИРОВАТЬ ПО
			|	СведенияОДоходахНДФЛ.ФизическоеЛицо,
			|	СведенияОДоходахНДФЛ.Период,
			|	СведенияОДоходахНДФЛ.НалоговаяБаза
			|
			|ИМЕЮЩИЕ
			|	СУММА(СведенияОДоходахНДФЛ.СуммаДохода - СведенияОДоходахНДФЛ.СуммаВычета) <> 0
			|
			|УПОРЯДОЧИТЬ ПО
			|	ФизическоеЛицо,
			|	НалоговаяБаза,
			|	Период";
			ТаблицаРасчетаНарастающимИтогом = Запрос.Выполнить().Выгрузить();
			
			Запрос.Текст =
			"ВЫБРАТЬ
			|	СтандартныеИмущественныеВычеты.ФизическоеЛицо КАК ФизическоеЛицо,
			|	СУММА(СтандартныеИмущественныеВычеты.Сумма) КАК Сумма,
			|	НАЧАЛОПЕРИОДА(СтандартныеИмущественныеВычеты.МесяцНалоговогоПериода, МЕСЯЦ) КАК НачалоМесяца
			|ИЗ
			|	ВТСтандартныеИмущественныеВычеты КАК СтандартныеИмущественныеВычеты
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСотрудникиСПревышением КАК СотрудникиСПревышением
			|		ПО СтандартныеИмущественныеВычеты.ФизическоеЛицо = СотрудникиСПревышением.ФизическоеЛицо
			|			И (ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ОплатаТруда) = СотрудникиСПревышением.НалоговаяБаза)
			|
			|СГРУППИРОВАТЬ ПО
			|	СтандартныеИмущественныеВычеты.ФизическоеЛицо,
			|	НАЧАЛОПЕРИОДА(СтандартныеИмущественныеВычеты.МесяцНалоговогоПериода, МЕСЯЦ)";
			ТаблицаВычетов = Запрос.Выполнить().Выгрузить();
			ИскатьВычеты = ТаблицаВычетов.Количество() > 0;
			Если ИскатьВычеты И ТаблицаВычетов.Количество() > 100 Тогда
				ТаблицаВычетов.Индексы.Добавить("ФизическоеЛицо,НачалоМесяца");
			КонецЕсли;
			ПоискВычетов = Новый Структура("ФизическоеЛицо,НачалоМесяца");
			
			// Расчет облагаемого дохода нарастающим итогом с учетом всех вычетов для каждой даты получения дохода.
			ОблагаемыйДоходСНачалаГода = 0;
			ТекущееФизлицо = Неопределено;
			ТекущаяНалоговаяБаза = Неопределено;
			ТекущееНачалоМесяца = Неопределено;
			Для каждого СтрокаТаблицы Из ТаблицаРасчетаНарастающимИтогом Цикл
				Если ТекущееФизлицо <> СтрокаТаблицы.ФизическоеЛицо Или ТекущаяНалоговаяБаза <> СтрокаТаблицы.НалоговаяБаза Тогда
					ОблагаемыйДоходСНачалаГода = 0;
					ТекущееФизлицо = СтрокаТаблицы.ФизическоеЛицо;
					ТекущаяНалоговаяБаза = СтрокаТаблицы.НалоговаяБаза;
					ТекущееНачалоМесяца = Неопределено;
				КонецЕсли;
				// Стандартные, имущественные вычеты учтем один раз за каждый месяц - в первую дату получения дохода месяца.
				ПредоставленныеВычеты = 0;
				Если ИскатьВычеты И СтрокаТаблицы.НалоговаяБаза = Перечисления.КатегорииДоходовНДФЛ.ОплатаТруда И ТекущееНачалоМесяца <> СтрокаТаблицы.НачалоМесяца Тогда
					ЗаполнитьЗначенияСвойств(ПоискВычетов, СтрокаТаблицы);
					СтрокиВычетов = ТаблицаВычетов.НайтиСтроки(ПоискВычетов);
					Если СтрокиВычетов.Количество() > 0 Тогда
						ПредоставленныеВычеты = СтрокиВычетов[0].Сумма;
					КонецЕсли;
					ТекущееНачалоМесяца = СтрокаТаблицы.НачалоМесяца;
				КонецЕсли;
				СтрокаТаблицы.ЭтоДеньПревышенияПредела = ОблагаемыйДоходСНачалаГода < ПараметрыРасчетаНДФЛПоПрогрессивнойШкале.Предел И ОблагаемыйДоходСНачалаГода + СтрокаТаблицы.ОблагаемыйДоход - ПредоставленныеВычеты > ПараметрыРасчетаНДФЛПоПрогрессивнойШкале.Предел;
				ОблагаемыйДоходСНачалаГода = ОблагаемыйДоходСНачалаГода + СтрокаТаблицы.ОблагаемыйДоход - ПредоставленныеВычеты;
				СтрокаТаблицы.ОблагаемыйДоходСНачалаГода = ОблагаемыйДоходСНачалаГода;
				СтрокаТаблицы.ПределПревышен = ОблагаемыйДоходСНачалаГода > ПараметрыРасчетаНДФЛПоПрогрессивнойШкале.Предел;
			КонецЦикла;
			
			Запрос.УстановитьПараметр("РасчетНарастающимИтогом", ТаблицаРасчетаНарастающимИтогом); ТаблицаРасчетаНарастающимИтогом = Неопределено;
			Запрос.Текст =
			"ВЫБРАТЬ
			|	РасчетНарастающимИтогом.ФизическоеЛицо КАК ФизическоеЛицо,
			|	РасчетНарастающимИтогом.Период КАК Период,
			|	РасчетНарастающимИтогом.НалоговаяБаза КАК НалоговаяБаза,
			|	РасчетНарастающимИтогом.ОблагаемыйДоход КАК ОблагаемыйДоход,
			|	РасчетНарастающимИтогом.ОблагаемыйДоходСНачалаГода КАК ОблагаемыйДоходСНачалаГода,
			|	РасчетНарастающимИтогом.ЭтоДеньПревышенияПредела КАК ЭтоДеньПревышенияПредела,
			|	РасчетНарастающимИтогом.ПределПревышен КАК ПределПревышен
			|ПОМЕСТИТЬ ВТРасчетНарастающимИтогом
			|ИЗ
			|	&РасчетНарастающимИтогом КАК РасчетНарастающимИтогом
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ДоходыПоСтавкам.СтавкаНалога КАК СтавкаНалога,
			|	ДоходыПоСтавкам.Ставка КАК Ставка,
			|	ДоходыПоСтавкам.Регистратор КАК Регистратор,
			|	ДоходыПоСтавкам.ФизическоеЛицо КАК ФизическоеЛицо,
			|	ДоходыПоСтавкам.Начисление КАК Начисление,
			|	ДоходыПоСтавкам.Период КАК Период,
			|	ДоходыПоСтавкам.НалоговаяБаза КАК НалоговаяБаза,
			|	ДоходыПоСтавкам.КатегорияДохода КАК КатегорияДохода,
			|	ДоходыПоСтавкам.КБК КАК КБК,
			|	ДоходыПоСтавкам.ДанныеДляОтчета КАК ДанныеДляОтчета,
			|	ДоходыПоСтавкам.КодДохода КАК КодДохода,
			|	ДоходыПоСтавкам.СуммаДохода КАК СуммаДохода,
			|	ДоходыПоСтавкам.КодВычета КАК КодВычета,
			|	ДоходыПоСтавкам.СуммаВычета КАК СуммаВычета,
			|	ДоходыПоСтавкам.СтрокаРаздела2 КАК СтрокаРаздела2,
			|	ЕСТЬNULL(РасчетНарастающимИтогом.ОблагаемыйДоходСНачалаГода, 0) КАК ОблагаемыйДоходСНачалаГода,
			|	ЕСТЬNULL(РасчетНарастающимИтогом.ЭтоДеньПревышенияПредела, ЛОЖЬ) КАК ЭтоДеньПревышенияПредела,
			|	ЕСТЬNULL(РасчетНарастающимИтогом.ПределПревышен, ЛОЖЬ) КАК ПределПревышен,
			|	ЕСТЬNULL(РасчетНарастающимИтогом.ОблагаемыйДоход, 0) КАК ОблагаемыйДоходЗаДень
			|ПОМЕСТИТЬ ВТРасширенныеДанныеОДоходах
			|ИЗ
			|	ВТДоходыПоСтавкам КАК ДоходыПоСтавкам
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРасчетНарастающимИтогом КАК РасчетНарастающимИтогом
			|		ПО ДоходыПоСтавкам.ФизическоеЛицо = РасчетНарастающимИтогом.ФизическоеЛицо
			|			И ДоходыПоСтавкам.Период = РасчетНарастающимИтогом.Период
			|			И ДоходыПоСтавкам.НалоговаяБаза = РасчетНарастающимИтогом.НалоговаяБаза
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	РасширенныеДанныеОДоходах.СтавкаНалога КАК СтавкаНалога,
			|	РасширенныеДанныеОДоходах.Ставка КАК Ставка,
			|	РасширенныеДанныеОДоходах.Регистратор КАК Регистратор,
			|	РасширенныеДанныеОДоходах.ФизическоеЛицо КАК ФизическоеЛицо,
			|	РасширенныеДанныеОДоходах.Начисление КАК Начисление,
			|	РасширенныеДанныеОДоходах.Период КАК Период,
			|	РасширенныеДанныеОДоходах.НалоговаяБаза КАК НалоговаяБаза,
			|	РасширенныеДанныеОДоходах.КатегорияДохода КАК КатегорияДохода,
			|	РасширенныеДанныеОДоходах.СтрокаРаздела2 КАК СтрокаРаздела2,
			|	РасширенныеДанныеОДоходах.КБК КАК КБК,
			|	РасширенныеДанныеОДоходах.КодДохода КАК КодДохода,
			|	СУММА(РасширенныеДанныеОДоходах.СуммаДохода) КАК СуммаДохода,
			|	РасширенныеДанныеОДоходах.КодВычета КАК КодВычета,
			|	СУММА(РасширенныеДанныеОДоходах.СуммаВычета) КАК СуммаВычета,
			|	СУММА(РасширенныеДанныеОДоходах.СуммаДохода - РасширенныеДанныеОДоходах.СуммаВычета) КАК ОблагаемаяСумма,
			|	РасширенныеДанныеОДоходах.ОблагаемыйДоходСНачалаГода КАК ОблагаемыйДоходСНачалаГода,
			|	РасширенныеДанныеОДоходах.ОблагаемыйДоходЗаДень КАК ОблагаемыйДоходЗаДень,
			|	РасширенныеДанныеОДоходах.ДанныеДляОтчета КАК ДанныеДляОтчета
			|ИЗ
			|	ВТРасширенныеДанныеОДоходах КАК РасширенныеДанныеОДоходах
			|ГДЕ
			|	РасширенныеДанныеОДоходах.ЭтоДеньПревышенияПредела
			|
			|СГРУППИРОВАТЬ ПО
			|	РасширенныеДанныеОДоходах.СтавкаНалога,
			|	РасширенныеДанныеОДоходах.Ставка,
			|	РасширенныеДанныеОДоходах.Регистратор,
			|	РасширенныеДанныеОДоходах.ФизическоеЛицо,
			|	РасширенныеДанныеОДоходах.Начисление,
			|	РасширенныеДанныеОДоходах.Период,
			|	РасширенныеДанныеОДоходах.НалоговаяБаза,
			|	РасширенныеДанныеОДоходах.КатегорияДохода,
			|	РасширенныеДанныеОДоходах.КБК,
			|	РасширенныеДанныеОДоходах.КодДохода,
			|	РасширенныеДанныеОДоходах.КодВычета,
			|	РасширенныеДанныеОДоходах.ОблагаемыйДоходСНачалаГода,
			|	РасширенныеДанныеОДоходах.ОблагаемыйДоходЗаДень,
			|	РасширенныеДанныеОДоходах.ДанныеДляОтчета,
			|	РасширенныеДанныеОДоходах.СтрокаРаздела2
			|
			|УПОРЯДОЧИТЬ ПО
			|	ФизическоеЛицо,
			|	НалоговаяБаза,
			|	КодДохода";
			
			ТаблицаРасчетаНарастающимИтогом = Запрос.Выполнить().Выгрузить();
			ДоходыСУточненнымиСтавками = ТаблицаРасчетаНарастающимИтогом.СкопироватьКолонки();
			
			ТекущееФизлицо = Неопределено;
			ТекущаяНалоговаяБаза = Неопределено;
			СтрокиРаспределения = Новый Массив;
			ОблагаемыйДоходДоПредела = 0;
			Для каждого СтрокаТаблицы Из ТаблицаРасчетаНарастающимИтогом Цикл
				Если ТекущееФизлицо <> СтрокаТаблицы.ФизическоеЛицо Или ТекущаяНалоговаяБаза <> СтрокаТаблицы.НалоговаяБаза Тогда
					Если ОблагаемыйДоходДоПредела <> 0 Тогда
						ВыделитьСуммыПревышенияПредела(ОблагаемыйДоходДоПредела, СтрокиРаспределения, ДоходыСУточненнымиСтавками)
					КонецЕсли;
					СтрокиРаспределения = Новый Массив;
					ОблагаемыйДоходДоПредела = 0;
					ТекущееФизлицо = СтрокаТаблицы.ФизическоеЛицо;
					ТекущаяНалоговаяБаза = СтрокаТаблицы.НалоговаяБаза;
				КонецЕсли;
				Если ОблагаемыйДоходДоПредела = 0 Тогда
					ОблагаемыйДоходДоПредела = СтрокаТаблицы.ОблагаемыйДоходЗаДень - СтрокаТаблицы.ОблагаемыйДоходСНачалаГода + ПараметрыРасчетаНДФЛПоПрогрессивнойШкале.Предел
				КонецЕсли;
				СтрокиРаспределения.Добавить(СтрокаТаблицы);
			КонецЦикла;
			Если ОблагаемыйДоходДоПредела <> 0 Тогда
				ВыделитьСуммыПревышенияПредела(ОблагаемыйДоходДоПредела, СтрокиРаспределения, ДоходыСУточненнымиСтавками)
			КонецЕсли;
			
			ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ТаблицаРасчетаНарастающимИтогом, ДоходыСУточненнымиСтавками); ТаблицаРасчетаНарастающимИтогом = Неопределено;
			
			Запрос.УстановитьПараметр("ДоходыСУточненнымиСтавками", ДоходыСУточненнымиСтавками); ДоходыСУточненнымиСтавками = Неопределено;
			Запрос.Текст =
			"УНИЧТОЖИТЬ ВТДоходыПоСтавкам
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ДоходыСУточненнымиСтавками.СтавкаНалога КАК СтавкаНалога,
			|	ДоходыСУточненнымиСтавками.Ставка КАК Ставка,
			|	ДоходыСУточненнымиСтавками.Регистратор КАК Регистратор,
			|	ДоходыСУточненнымиСтавками.ФизическоеЛицо КАК ФизическоеЛицо,
			|	ДоходыСУточненнымиСтавками.Начисление КАК Начисление,
			|	ДоходыСУточненнымиСтавками.Период КАК Период,
			|	ДоходыСУточненнымиСтавками.ДанныеДляОтчета КАК ДанныеДляОтчета,
			|	ДоходыСУточненнымиСтавками.НалоговаяБаза КАК НалоговаяБаза,
			|	ДоходыСУточненнымиСтавками.КатегорияДохода КАК КатегорияДохода,
			|	ДоходыСУточненнымиСтавками.СтрокаРаздела2 КАК СтрокаРаздела2,
			|	ВЫБОР
			|		КОГДА ДоходыСУточненнымиСтавками.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка15)
			|			ТОГДА &КБКсПревышения
			|		ИНАЧЕ ДоходыСУточненнымиСтавками.КБК
			|	КОНЕЦ КАК КБК,
			|	ДоходыСУточненнымиСтавками.КодДохода КАК КодДохода,
			|	ДоходыСУточненнымиСтавками.СуммаДохода КАК СуммаДохода,
			|	ДоходыСУточненнымиСтавками.КодВычета КАК КодВычета,
			|	ДоходыСУточненнымиСтавками.СуммаВычета КАК СуммаВычета
			|ПОМЕСТИТЬ ВТДоходыСУточненнымиСтавками
			|ИЗ
			|	&ДоходыСУточненнымиСтавками КАК ДоходыСУточненнымиСтавками
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВЫБОР
			|		КОГДА РасширенныеДанныеОДоходах.ПределПревышен
			|			ТОГДА &СтавкаЧисломСПревышения
			|		ИНАЧЕ РасширенныеДанныеОДоходах.СтавкаНалога
			|	КОНЕЦ КАК СтавкаНалога,
			|	ВЫБОР
			|		КОГДА РасширенныеДанныеОДоходах.ПределПревышен
			|			ТОГДА &СтавкаСПревышения
			|		ИНАЧЕ РасширенныеДанныеОДоходах.Ставка
			|	КОНЕЦ КАК Ставка,
			|	РасширенныеДанныеОДоходах.Регистратор КАК Регистратор,
			|	РасширенныеДанныеОДоходах.ФизическоеЛицо КАК ФизическоеЛицо,
			|	РасширенныеДанныеОДоходах.Начисление КАК Начисление,
			|	РасширенныеДанныеОДоходах.Период КАК Период,
			|	РасширенныеДанныеОДоходах.ДанныеДляОтчета КАК ДанныеДляОтчета,
			|	РасширенныеДанныеОДоходах.НалоговаяБаза КАК НалоговаяБаза,
			|	РасширенныеДанныеОДоходах.КатегорияДохода КАК КатегорияДохода,
			|	РасширенныеДанныеОДоходах.СтрокаРаздела2 КАК СтрокаРаздела2,
			|	ВЫБОР
			|		КОГДА РасширенныеДанныеОДоходах.ПределПревышен
			|			ТОГДА &КБКсПревышения
			|		ИНАЧЕ РасширенныеДанныеОДоходах.КБК
			|	КОНЕЦ КАК КБК,
			|	РасширенныеДанныеОДоходах.КодДохода КАК КодДохода,
			|	РасширенныеДанныеОДоходах.СуммаДохода КАК СуммаДохода,
			|	РасширенныеДанныеОДоходах.КодВычета КАК КодВычета,
			|	РасширенныеДанныеОДоходах.СуммаВычета КАК СуммаВычета
			|ПОМЕСТИТЬ ВТДоходыПоСтавкам
			|ИЗ
			|	ВТРасширенныеДанныеОДоходах КАК РасширенныеДанныеОДоходах
			|ГДЕ
			|	НЕ РасширенныеДанныеОДоходах.ЭтоДеньПревышенияПредела
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ДоходыСУточненнымиСтавками.СтавкаНалога,
			|	ДоходыСУточненнымиСтавками.Ставка,
			|	ДоходыСУточненнымиСтавками.Регистратор,
			|	ДоходыСУточненнымиСтавками.ФизическоеЛицо,
			|	ДоходыСУточненнымиСтавками.Начисление,
			|	ДоходыСУточненнымиСтавками.Период,
			|	ДоходыСУточненнымиСтавками.ДанныеДляОтчета,
			|	ДоходыСУточненнымиСтавками.НалоговаяБаза,
			|	ДоходыСУточненнымиСтавками.КатегорияДохода,
			|	ДоходыСУточненнымиСтавками.СтрокаРаздела2,
			|	ДоходыСУточненнымиСтавками.КБК,
			|	ДоходыСУточненнымиСтавками.КодДохода,
			|	ДоходыСУточненнымиСтавками.СуммаДохода,
			|	ДоходыСУточненнымиСтавками.КодВычета,
			|	ДоходыСУточненнымиСтавками.СуммаВычета
			|ИЗ
			|	ВТДоходыСУточненнымиСтавками КАК ДоходыСУточненнымиСтавками";
			Запрос.Выполнить();
		КонецЕсли;
		
		Если ОписаниеТаблиц.Свойство("КоличествоПолучателейДохода") Тогда
			
			Запрос.Текст =
			"ВЫБРАТЬ
			|	ЕСТЬNULL(КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СведенияОДоходахНДФЛ.ФизическоеЛицо), 0) КАК П000020012003,
			|	СведенияОДоходахНДФЛ.Ставка КАК Ставка,
			|	СведенияОДоходахНДФЛ.КБК КАК КБК
			|ИЗ
			|	(ВЫБРАТЬ
			|		СведенияОДоходахНДФЛ.ФизическоеЛицо КАК ФизическоеЛицо,
			|		СведенияОДоходахНДФЛ.Ставка КАК Ставка,
			|		СведенияОДоходахНДФЛ.КБК КАК КБК,
			|		СУММА(СведенияОДоходахНДФЛ.СуммаДохода) КАК СуммаДохода
			|	ИЗ
			|		ВТДоходыПоСтавкам КАК СведенияОДоходахНДФЛ
			|	ГДЕ
			|		СведенияОДоходахНДФЛ.ДанныеДляОтчета
			|	
			|	СГРУППИРОВАТЬ ПО
			|		СведенияОДоходахНДФЛ.ФизическоеЛицо,
			|		СведенияОДоходахНДФЛ.Ставка,
			|		СведенияОДоходахНДФЛ.КБК) КАК СведенияОДоходахНДФЛ
			|ГДЕ
			|	СведенияОДоходахНДФЛ.СуммаДохода <> 0
			|
			|СГРУППИРОВАТЬ ПО
			|	СведенияОДоходахНДФЛ.Ставка,
			|	СведенияОДоходахНДФЛ.КБК";
			
			ОписаниеТаблиц.КоличествоПолучателейДохода = Запрос.Выполнить().Выгрузить()
			
		КонецЕсли;
		
		Если ОписаниеТаблиц.Свойство("Раздел2Доходы") Тогда
			
			Запрос.УстановитьПараметр("СтрокиРаздела2ПоКодамДохода", УчетНДФЛПовтИсп.СтрокиРаздела2Расчета6НДФЛПоКодамДохода());
			
			ПоДатамТрудовыхДоговоров = Новый Массив;
			ПоДатамТрудовыхДоговоров.Добавить(УчетНДФЛПовтИсп.Доход2710());
			ПоДатамТрудовыхДоговоров.Добавить(Справочники.ВидыДоходовНДФЛ.Код2720);
			ПоДатамТрудовыхДоговоров.Добавить(Справочники.ВидыДоходовНДФЛ.Код2760);
			ПоДатамТрудовыхДоговоров.Добавить(Справочники.ВидыДоходовНДФЛ.Код4800);
			Запрос.УстановитьПараметр("ПоДатамДоговоров", ПоДатамТрудовыхДоговоров);
			
			Запрос.Текст =
			"ВЫБРАТЬ
			|	СтрокиРаздела2ПоКодамДохода.КодДохода КАК КодДохода,
			|	СтрокиРаздела2ПоКодамДохода.СтрокаРаздела2Расчета6НДФЛ КАК СтрокаРаздела2
			|ПОМЕСТИТЬ ВТСтрокиРаздела2ПоКодамДохода
			|ИЗ
			|	&СтрокиРаздела2ПоКодамДохода КАК СтрокиРаздела2ПоКодамДохода
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	СведенияОДоходахНДФЛ.Период КАК Период,
			|	СведенияОДоходахНДФЛ.СтавкаНалога КАК СтавкаНалога,
			|	СведенияОДоходахНДФЛ.Ставка КАК Ставка,
			|	СведенияОДоходахНДФЛ.Регистратор КАК Регистратор,
			|	СведенияОДоходахНДФЛ.ФизическоеЛицо КАК ФизическоеЛицо,
			|	СведенияОДоходахНДФЛ.Начисление КАК Начисление,
			|	СведенияОДоходахНДФЛ.КБК КАК КБК,
			|	СведенияОДоходахНДФЛ.КодДохода КАК КодДохода,
			|	СведенияОДоходахНДФЛ.СуммаДохода КАК СуммаДохода,
			|	ВЫБОР
			|		КОГДА СведенияОДоходахНДФЛ.СтрокаРаздела2 <> ЗНАЧЕНИЕ(Перечисление.СтрокиРаздела2Расчета6НДФЛ.ПустаяСсылка)
			|			ТОГДА СведенияОДоходахНДФЛ.СтрокаРаздела2
			|		ИНАЧЕ СтрокиРаздела2ПоКодамДохода.СтрокаРаздела2
			|	КОНЕЦ КАК СтрокаРаздела2
			|ПОМЕСТИТЬ ВТДоходыСоСтрокамиРаздела2
			|ИЗ
			|	ВТДоходыПоСтавкам КАК СведенияОДоходахНДФЛ
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтрокиРаздела2ПоКодамДохода КАК СтрокиРаздела2ПоКодамДохода
			|		ПО СведенияОДоходахНДФЛ.КодДохода = СтрокиРаздела2ПоКодамДохода.КодДохода
			|ГДЕ
			|	СведенияОДоходахНДФЛ.ДанныеДляОтчета
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ФизЛица.ФизическоеЛицо КАК ФизическоеЛицо,
			|	&НачалоПериода КАК НачалоПериода,
			|	&ОкончаниеПериода КАК ОкончаниеПериода,
			|	&ГоловнаяОрганизация КАК ГоловнаяОрганизация
			|ИЗ
			|	ВТДоходыСоСтрокамиРаздела2 КАК ФизЛица
			|ГДЕ
			|	ФизЛица.СтрокаРаздела2 ЕСТЬ NULL";
			Результат = Запрос.Выполнить();
			Если Не Результат.Пустой() Тогда
				
				ФизЛицаОрганизаций = Результат.Выгрузить();
				Запрос.УстановитьПараметр("ТаблицаДоговоров", КадровыйУчет.ДоговорыФизическихЛиц(ФизЛицаОрганизаций)); ФизЛицаОрганизаций = Неопределено;
				
				Запрос.Текст =
				"ВЫБРАТЬ
				|	ТаблицаДоговоров.ФизическоеЛицо КАК ФизическоеЛицо,
				|	ТаблицаДоговоров.ВидДоговора КАК ВидДоговора,
				|	ТаблицаДоговоров.Окончание КАК Окончание,
				|	ТаблицаДоговоров.Начало КАК Начало
				|ПОМЕСТИТЬ ВТДоговоры
				|ИЗ
				|	&ТаблицаДоговоров КАК ТаблицаДоговоров
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	СведенияОДоходахНДФЛ.ФизическоеЛицо КАК ФизическоеЛицо,
				|	СведенияОДоходахНДФЛ.Период КАК Период,
				|	НЕ МИНИМУМ(ФизЛица.ВидДоговора) КАК ЕстьТрудовойДоговор
				|ПОМЕСТИТЬ ВТДниДоговоров
				|ИЗ
				|	ВТДоходыПоСтавкам КАК СведенияОДоходахНДФЛ
				|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДоговоры КАК ФизЛица
				|		ПО (ФизЛица.Начало <= СведенияОДоходахНДФЛ.Период)
				|			И (ФизЛица.Окончание = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
				|				ИЛИ ФизЛица.Окончание >= СведенияОДоходахНДФЛ.Период)
				|			И СведенияОДоходахНДФЛ.ФизическоеЛицо = ФизЛица.ФизическоеЛицо
				|ГДЕ
				|	ФизЛица.ФизическоеЛицо ЕСТЬ НЕ NULL
				|	И СведенияОДоходахНДФЛ.ДанныеДляОтчета
				|
				|СГРУППИРОВАТЬ ПО
				|	СведенияОДоходахНДФЛ.ФизическоеЛицо,
				|	СведенияОДоходахНДФЛ.Период
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	СведенияОДоходахНДФЛ.СтавкаНалога КАК СтавкаНалога,
				|	СведенияОДоходахНДФЛ.Ставка КАК Ставка,
				|	СведенияОДоходахНДФЛ.Регистратор КАК Регистратор,
				|	СведенияОДоходахНДФЛ.ФизическоеЛицо КАК ФизическоеЛицо,
				|	СведенияОДоходахНДФЛ.Начисление КАК Начисление,
				|	СведенияОДоходахНДФЛ.КБК КАК КБК,
				|	СведенияОДоходахНДФЛ.КодДохода КАК КодДохода,
				|	СведенияОДоходахНДФЛ.СуммаДохода КАК СуммаДохода,
				#Вставка
				|	СведенияОДоходахНДФЛ.Период КАК Период,
				#КонецВставки
				|	ВЫБОР
				|		КОГДА СведенияОДоходахНДФЛ.СтрокаРаздела2 ЕСТЬ НЕ NULL
				|			ТОГДА СведенияОДоходахНДФЛ.СтрокаРаздела2
				|		КОГДА СведенияОДоходахНДФЛ.КодДохода В (&ПоДатамДоговоров)
				|			ТОГДА ВЫБОР
				|					КОГДА ЕСТЬNULL(ДниДоговоров.ЕстьТрудовойДоговор, ЛОЖЬ)
				|						ТОГДА ЗНАЧЕНИЕ(Перечисление.СтрокиРаздела2Расчета6НДФЛ.ТрудовойДоговор)
				|					КОГДА НЕ ДниДоговоров.ЕстьТрудовойДоговор
				|						ТОГДА ЗНАЧЕНИЕ(Перечисление.СтрокиРаздела2Расчета6НДФЛ.ДоговорГПХ)
				|					ИНАЧЕ НЕОПРЕДЕЛЕНО
				|				КОНЕЦ
				|		ИНАЧЕ НЕОПРЕДЕЛЕНО
				|	КОНЕЦ КАК СтрокаРаздела2
				|ПОМЕСТИТЬ ВТПодробныеДоходы
				|ИЗ
				|	ВТДоходыСоСтрокамиРаздела2 КАК СведенияОДоходахНДФЛ
				|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДниДоговоров КАК ДниДоговоров
				|		ПО СведенияОДоходахНДФЛ.ФизическоеЛицо = ДниДоговоров.ФизическоеЛицо
				|			И СведенияОДоходахНДФЛ.Период = ДниДоговоров.Период
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|УНИЧТОЖИТЬ ВТДоходыСоСтрокамиРаздела2
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ПодробныеДоходы.СтавкаНалога КАК СтавкаНалога,
				|	ПодробныеДоходы.Ставка КАК Ставка,
				|	ПодробныеДоходы.Регистратор КАК Регистратор,
				|	ПодробныеДоходы.ФизическоеЛицо КАК ФизическоеЛицо,
				|	ПодробныеДоходы.Начисление КАК Начисление,
				|	ПодробныеДоходы.КБК КАК КБК,
				|	ПодробныеДоходы.КодДохода КАК КодДохода,
				|	ПодробныеДоходы.СуммаДохода КАК СуммаДохода,
				#Вставка
				|	ПодробныеДоходы.Период КАК Период,
				#КонецВставки
				|	ПодробныеДоходы.СтрокаРаздела2 КАК СтрокаРаздела2
				|ПОМЕСТИТЬ ВТДоходыСоСтрокамиРаздела2
				|ИЗ
				|	ВТПодробныеДоходы КАК ПодробныеДоходы";
				Запрос.Выполнить();
				
			КонецЕсли;
			
			ТекстЗапроса =
			"ВЫБРАТЬ
			|	СведенияОДоходах.ФизическоеЛицо КАК ФизическоеЛицо,
			|	СведенияОДоходах.КодДохода КАК КодДохода,
			|	СведенияОДоходах.Начисление КАК Начисление,
			|	СведенияОДоходах.Регистратор КАК Регистратор,
			|	СведенияОДоходах.СтавкаНалога КАК СтавкаНалога,
			|	СведенияОДоходах.Ставка КАК Ставка,
			|	СведенияОДоходах.КБК КАК КБК,
			#Вставка
			|	СведенияОДоходах.Период КАК Период,
			#КонецВставки
			|	СУММА(СведенияОДоходах.СуммаДохода) КАК П000020011003,	
			|	СУММА(ВЫБОР
			|			КОГДА СведенияОДоходах.СтрокаРаздела2 = ЗНАЧЕНИЕ(Перечисление.СтрокиРаздела2Расчета6НДФЛ.Дивиденды)
			|				ТОГДА СведенияОДоходах.СуммаДохода
			|			ИНАЧЕ 0
			|		КОНЕЦ) КАК П000020011103,
			|	СУММА(ВЫБОР
			|			КОГДА СведенияОДоходах.СтрокаРаздела2 = ЗНАЧЕНИЕ(Перечисление.СтрокиРаздела2Расчета6НДФЛ.ТрудовойДоговор)
			|				ТОГДА СведенияОДоходах.СуммаДохода
			|			ИНАЧЕ 0
			|		КОНЕЦ) КАК П000020011203,
			|	СУММА(ВЫБОР
			|			КОГДА СведенияОДоходах.СтрокаРаздела2 = ЗНАЧЕНИЕ(Перечисление.СтрокиРаздела2Расчета6НДФЛ.ДоговорГПХ)
			|				ТОГДА СведенияОДоходах.СуммаДохода
			|			ИНАЧЕ 0
			|		КОНЕЦ) КАК П000020011303
			|ИЗ
			|	ВТДоходыСоСтрокамиРаздела2 КАК СведенияОДоходах
			|
			|СГРУППИРОВАТЬ ПО
			|	СведенияОДоходах.ФизическоеЛицо,
			|	СведенияОДоходах.Ставка,
			|	СведенияОДоходах.КБК,
			|	СведенияОДоходах.КодДохода,
			|	СведенияОДоходах.Начисление,
			|	СведенияОДоходах.Регистратор,
			#Вставка
			|	СведенияОДоходах.Период,
			#КонецВставки
			|	СведенияОДоходах.СтавкаНалога";
			
			#Удаление
			МассивПолей = Новый Массив;
			Если Не ПодробныеДанные Тогда
				МассивПолей.Добавить("ФизическоеЛицо");
				МассивПолей.Добавить("КодДохода");
				МассивПолей.Добавить("Начисление");
				МассивПолей.Добавить("Регистратор");
			КонецЕсли;
			Запрос.Текст = УдалитьПоляРасшифровкиИзЗапроса(ТекстЗапроса, МассивПолей);
			#КонецУдаления
			#Вставка
			Запрос.Текст = ТекстЗапроса;
			#КонецВставки
			ОписаниеТаблиц.Раздел2Доходы = Запрос.Выполнить().Выгрузить()
			
		КонецЕсли;
		
		Если ОписаниеТаблиц.Свойство("Раздел2Вычеты") Тогда
			
			Запрос.Текст =
			"ВЫБРАТЬ
			|	СведенияОДоходахНДФЛ.КБК КАК КБК,
			|	СведенияОДоходахНДФЛ.Регистратор КАК Регистратор,
			|	СведенияОДоходахНДФЛ.ФизическоеЛицо КАК ФизическоеЛицо,
			#Вставка
			|	СведенияОДоходахНДФЛ.Период КАК Период,
			#КонецВставки
			|	СведенияОДоходахНДФЛ.КодВычета КАК КодВычета,
			|	СведенияОДоходахНДФЛ.СтавкаНалога КАК СтавкаНалога,
			|	СведенияОДоходахНДФЛ.Ставка КАК Ставка,
			|	СведенияОДоходахНДФЛ.СуммаВычета КАК СуммаВычета
			|ПОМЕСТИТЬ ВТВычетыПоСтавкам
			|ИЗ
			|	ВТДоходыПоСтавкам КАК СведенияОДоходахНДФЛ
			|ГДЕ
			|	СведенияОДоходахНДФЛ.СуммаВычета <> 0
			|	И СведенияОДоходахНДФЛ.ДанныеДляОтчета
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	&ОсновнойКБК,
			|	ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ.Регистратор,
			|	ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ.ФизическоеЛицо,
			#Вставка
			|	ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ.МесяцНалоговогоПериода,
			#КонецВставки
			|	ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ.КодВычета,
			|	13,
			|	ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13),
			|	ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ.Сумма
			|ИЗ
			|	ВТСтандартныеИмущественныеВычеты КАК ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ
			|ГДЕ
			|	ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ.ДанныеДляОтчета";
			Запрос.Выполнить();
			
			ТекстЗапроса =
			"ВЫБРАТЬ
			|	СведенияОДоходах.Ставка КАК Ставка,
			|	СведенияОДоходах.КБК КАК КБК,
			|	СведенияОДоходах.ФизическоеЛицо КАК ФизическоеЛицо,
			#Вставка
			|   СведенияОДоходах.Период КАК Период,
			#КонецВставки
			|	СведенияОДоходах.КодВычета КАК КодВычета,
			|	СведенияОДоходах.Регистратор КАК Регистратор,
			|	СведенияОДоходах.СтавкаНалога КАК СтавкаНалога,
			|	СУММА(СведенияОДоходах.СуммаВычета) КАК П000020013003
			|ИЗ
			|	ВТВычетыПоСтавкам КАК СведенияОДоходах
			|
			|СГРУППИРОВАТЬ ПО
			|	СведенияОДоходах.Ставка,
			|	СведенияОДоходах.КБК,
			|	СведенияОДоходах.ФизическоеЛицо,
			#Вставка
			|	СведенияОДоходах.Период,
			#КонецВставки
			|	СведенияОДоходах.КодВычета,
			|	СведенияОДоходах.Регистратор,
			|	СведенияОДоходах.СтавкаНалога";
			
			#Удаление
			МассивПолей = Новый Массив;
			Если Не ПодробныеДанные Тогда
				МассивПолей.Добавить("ФизическоеЛицо");
				МассивПолей.Добавить("КодВычета");
				МассивПолей.Добавить("Регистратор");
			КонецЕсли;
			Запрос.Текст = УдалитьПоляРасшифровкиИзЗапроса(ТекстЗапроса, МассивПолей);
			#КонецУдаления
			#Вставка
			Запрос.Текст = ТекстЗапроса;
			#КонецВставки
			ОписаниеТаблиц.Раздел2Вычеты = Запрос.Выполнить().Выгрузить()
			
		КонецЕсли;
		
		Если ОписаниеТаблиц.Свойство("Приложение1Налогоплательщики") Тогда
			
			НеобходимыеКадровыеДанные = Новый Массив();
			НеобходимыеКадровыеДанные.Добавить("ФизическоеЛицо");
			НеобходимыеКадровыеДанные.Добавить("ИНН");
			НеобходимыеКадровыеДанные.Добавить("Наименование");
			НеобходимыеКадровыеДанные.Добавить("Фамилия");
			НеобходимыеКадровыеДанные.Добавить("Имя");
			НеобходимыеКадровыеДанные.Добавить("Отчество");
			НеобходимыеКадровыеДанные.Добавить("СтатусНалогоплательщика");
			НеобходимыеКадровыеДанные.Добавить("ДатаРождения");
			НеобходимыеКадровыеДанные.Добавить("ДокументВид");
			НеобходимыеКадровыеДанные.Добавить("ДокументСерия");
			НеобходимыеКадровыеДанные.Добавить("ДокументНомер");
			НеобходимыеКадровыеДанные.Добавить("ДокументСтранаВыдачи");
			НеобходимыеКадровыеДанные.Добавить("Страна");
			
			ОписаниеТаблиц.Приложение1Налогоплательщики = Новый ТаблицаЗначений;
			Если НомерКорректировки = 99 Тогда
			ИначеЕсли НомерКорректировки > 0 Тогда
			Иначе
				
				Запрос.Текст =
				"ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	СведенияОДоходах.ФизическоеЛицо КАК ФизическоеЛицо
				|ИЗ
				|	ВТДоходыСоСтрокамиРаздела2 КАК СведенияОДоходах";
				КадровыйУчет.СоздатьНаДатуВТКадровыеДанныеФизическихЛиц(Запрос.МенеджерВременныхТаблиц, Истина, Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ФизическоеЛицо"), НеобходимыеКадровыеДанные, ОкончаниеПериода);
				
				Запрос.Текст =
				"ВЫБРАТЬ
				|	КадровыеДанныеФизЛиц.ФизическоеЛицо КАК ФизическоеЛицо,
				|	КадровыеДанныеФизЛиц.ИНН КАК ИНН,
				|	КадровыеДанныеФизЛиц.Фамилия КАК Фамилия,
				|	КадровыеДанныеФизЛиц.Имя КАК Имя,
				|	КадровыеДанныеФизЛиц.Отчество КАК Отчество,
				|	КадровыеДанныеФизЛиц.СтатусНалогоплательщика КАК СтатусНалогоплательщика,
				|	КадровыеДанныеФизЛиц.ДатаРождения КАК ДатаРождения,
				|	ЕСТЬNULL(КадровыеДанныеФизЛиц.Страна, ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)) КАК Гражданство,
				|	КадровыеДанныеФизЛиц.ДокументСтранаВыдачи КАК СтранаВыдачиДокумента,
				|	КадровыеДанныеФизЛиц.ДокументВид КАК ВидДокумента,
				|	КадровыеДанныеФизЛиц.ДокументСерия КАК СерияДокумента,
				|	КадровыеДанныеФизЛиц.ДокументНомер КАК НомерДокумента,
				|	КадровыеДанныеФизЛиц.Наименование КАК Наименование
				|ИЗ
				|	ВТКадровыеДанныеФизическихЛиц КАК КадровыеДанныеФизЛиц
				|
				|УПОРЯДОЧИТЬ ПО
				|	Наименование";
				ОписаниеТаблиц.Приложение1Налогоплательщики = Запрос.Выполнить().Выгрузить();
				
			КонецЕсли;
		КонецЕсли;
		
		Если ОписаниеТаблиц.Свойство("Приложение1Доходы") Тогда
			Запрос.Текст =
			"ВЫБРАТЬ
			|	СведенияОДоходах.ФизическоеЛицо КАК ФизическоеЛицо,
			|	НАЧАЛОПЕРИОДА(СведенияОДоходах.Период, МЕСЯЦ) КАК Период,
			|	СведенияОДоходах.СтавкаНалога КАК Ставка,
			|	СведенияОДоходах.КодДохода.КодПрименяемыйВНалоговойОтчетностиС2021Года КАК П000П1М500002,
			|	СУММА(СведенияОДоходах.СуммаДохода) КАК П000П1М500003,
			|	СведенияОДоходах.КодВычета.КодПрименяемыйВНалоговойОтчетностиС2016Года КАК П000П1М600004,
			|	СУММА(СведенияОДоходах.СуммаВычета) КАК П000П1М600005
			|ИЗ
			|	ВТДоходыПоСтавкам КАК СведенияОДоходах
			|ГДЕ
			|	СведенияОДоходах.ДанныеДляОтчета
			|
			|СГРУППИРОВАТЬ ПО
			|	СведенияОДоходах.ФизическоеЛицо,
			|	СведенияОДоходах.КодДохода.КодПрименяемыйВНалоговойОтчетностиС2021Года,
			|	СведенияОДоходах.КодВычета.КодПрименяемыйВНалоговойОтчетностиС2016Года,
			|	СведенияОДоходах.СтавкаНалога,
			|	НАЧАЛОПЕРИОДА(СведенияОДоходах.Период, МЕСЯЦ)
			|
			|ИМЕЮЩИЕ
			|	(СУММА(СведенияОДоходах.СуммаДохода) <> 0
			|		ИЛИ СУММА(СведенияОДоходах.СуммаВычета) <> 0)
			|
			|УПОРЯДОЧИТЬ ПО
			|	ФизическоеЛицо,
			|	Ставка,
			|	Период,
			|	П000П1М500002";
			ОписаниеТаблиц.Приложение1Доходы = Запрос.Выполнить().Выгрузить();
		КонецЕсли;
		
	КонецЕсли;
	
	Если ОписаниеТаблиц.Свойство("Приложение1Вычеты") Тогда
		Запрос.Текст =
		"ВЫБРАТЬ
		|	СведенияОДоходах.СтавкаНалога КАК Ставка,
		|	СведенияОДоходах.ФизическоеЛицо КАК ФизическоеЛицо,
		|	СведенияОДоходах.КодВычета.ГруппаВычета КАК ГруппаВычета,
		|	СведенияОДоходах.КодВычета.КодПрименяемыйВНалоговойОтчетностиС2016Года КАК П000П1М200001,
		|	СУММА(СведенияОДоходах.СуммаВычета) КАК П000П1М200002
		|ИЗ
		|	ВТВычетыПоСтавкам КАК СведенияОДоходах
		|ГДЕ
		|	СведенияОДоходах.КодВычета.ГруппаВычета <> ЗНАЧЕНИЕ(Перечисление.ГруппыВычетовПоНДФЛ.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	СведенияОДоходах.СтавкаНалога,
		|	СведенияОДоходах.ФизическоеЛицо,
		|	СведенияОДоходах.КодВычета.ГруппаВычета,
		|	СведенияОДоходах.КодВычета.КодПрименяемыйВНалоговойОтчетностиС2016Года";
		ОписаниеТаблиц.Приложение1Вычеты = Запрос.Выполнить().Выгрузить()
	КонецЕсли;
	
	Если ОписаниеТаблиц.Свойство("Раздел2Налоги") Или ОписаниеТаблиц.Свойство("Приложение1Итоги") Или ОписаниеТаблиц.Свойство("Приложение1УведомленияОВычетах") Тогда
		
		УчетНДФЛ.СоздатьВТСтавкаНДФЛПоСтавкеРезидента(Запрос.МенеджерВременныхТаблиц, "ВТНалоги", "УчитыватьИзмененияСтатусаДляОтчетности", ОкончаниеПериода, "ВТСтавкаНДФЛПоНалогам");
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	НДФЛ.КБК КАК КБК,
		|	НДФЛ.ФизическоеЛицо КАК ФизическоеЛицо,
		#Вставка
		|	НДФЛ.ДатаПолученияДохода Как ДатаПолученияДохода,
		|	НДФЛ.ДатаУдержания Как ДатаУдержания,
		|	НДФЛ.Регистратор Как Регистратор,
		#КонецВставки
		|	СтавкаНДФЛПоСтавкеРезидента.СтавкаЧислом * 100 КАК СтавкаНалога,
		|	СтавкаНДФЛПоСтавкеРезидента.СтавкаНДФЛ КАК Ставка,
		|	ВЫБОР
		|		КОГДА НДФЛ.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				И (НДФЛ.ДатаПолученияДохода МЕЖДУ &НачалоПериода И &ОкончаниеПериода)
		|				И (НДФЛ.ДатаУдержания <= &ОкончаниеПериодаОсмотраДоходовВычетов
		|					ИЛИ НДФЛ.Регистратор <> НДФЛ.ДокументОснование)
		|			ТОГДА НДФЛ.Сумма
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Начислено,
		|	ВЫБОР
		|		КОГДА НДФЛ.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				И (НДФЛ.ДатаПолученияДохода МЕЖДУ &НачалоПериода И &ОкончаниеПериода)
		|				И (НДФЛ.КатегорияДохода В (ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.Дивиденды), ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ДивидендыПоСтавке05), ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ДивидендыПоСтавке10), ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ДивидендыПоСтавке12))
		|					ИЛИ НДФЛ.КатегорияДохода = ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ДоходыПредыдущихРедакций)
		|						И НДФЛ.СтавкаНалогообложенияРезидента = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавкиНалогообложенияРезидента.Ставка09))
		|				И НДФЛ.ДатаУдержания <= &ОкончаниеПериодаОсмотраДоходовВычетов
		|			ТОГДА НДФЛ.Сумма
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК НачисленоПоДивидендам,
		|	ВЫБОР
		|		КОГДА НДФЛ.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.ЗачетАвансовыхПлатежей)
		|				И (НДФЛ.ДатаПолученияДохода МЕЖДУ &НачалоПериода И &ОкончаниеПериода)
		|				И НДФЛ.ДатаУдержания <= &ОкончаниеПериодаОсмотраДоходовВычетов
		|			ТОГДА НДФЛ.Сумма
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ЗачтеноАвансов,
		|	ВЫБОР
		|		КОГДА НДФЛ.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.Удержано)
		|				И (НДФЛ.ДатаУдержания МЕЖДУ &НачалоПериода И &ОкончаниеПериода)
		|			ТОГДА НДФЛ.Сумма
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Удержано,
		|	ВЫБОР
		|		КОГДА НДФЛ.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.Удержано)
		|				И (НДФЛ.ДатаПолученияДохода МЕЖДУ &НачалоПериода И &ОкончаниеПериода)
		|			ТОГДА НДФЛ.Сумма
		|		КОГДА НДФЛ.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.ВозвращеноНалоговымАгентом)
		|				И (НДФЛ.ДатаПолученияДохода МЕЖДУ &НачалоПериода И &ОкончаниеПериода)
		|			ТОГДА НДФЛ.Сумма
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК УдержаноЗаНалоговыйПериод,
		|	ВЫБОР
		|		КОГДА НДФЛ.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				И (НДФЛ.ДатаПолученияДохода МЕЖДУ &НачалоПериода И &ОкончаниеПериода)
		|				И (НДФЛ.ДатаУдержания <= &ОкончаниеПериодаОсмотраДоходовВычетов
		|					ИЛИ НДФЛ.Регистратор <> НДФЛ.ДокументОснование)
		|			ТОГДА ВЫБОР
		|					КОГДА НДФЛ.НалогНаПрибыльДляДивидендов = 0
		|						ТОГДА НДФЛ.Сумма
		|					КОГДА ВЫБОР
		|							КОГДА НДФЛ.НалогНаПрибыльДляДивидендов * НДФЛ.СуммаСПревышения > 0
		|								ТОГДА ВЫБОР
		|										КОГДА НДФЛ.СуммаСПревышения > 0
		|											ТОГДА ВЫБОР
		|													КОГДА НДФЛ.НалогНаПрибыльДляДивидендов - НДФЛ.СуммаСПревышения > 0
		|														ТОГДА НДФЛ.НалогНаПрибыльДляДивидендов - НДФЛ.СуммаСПревышения
		|													ИНАЧЕ 0
		|												КОНЕЦ
		|										КОГДА НДФЛ.НалогНаПрибыльДляДивидендов - НДФЛ.СуммаСПревышения < 0
		|											ТОГДА НДФЛ.НалогНаПрибыльДляДивидендов - НДФЛ.СуммаСПревышения
		|										ИНАЧЕ 0
		|									КОНЕЦ
		|							ИНАЧЕ НДФЛ.НалогНаПрибыльДляДивидендов
		|						КОНЕЦ * НДФЛ.Сумма > 0
		|						ТОГДА ВЫБОР
		|								КОГДА НДФЛ.Сумма > 0
		|									ТОГДА ВЫБОР
		|											КОГДА НДФЛ.Сумма - ВЫБОР
		|													КОГДА НДФЛ.НалогНаПрибыльДляДивидендов * НДФЛ.СуммаСПревышения > 0
		|														ТОГДА ВЫБОР
		|																КОГДА НДФЛ.СуммаСПревышения > 0
		|																	ТОГДА ВЫБОР
		|																			КОГДА НДФЛ.НалогНаПрибыльДляДивидендов - НДФЛ.СуммаСПревышения > 0
		|																				ТОГДА НДФЛ.НалогНаПрибыльДляДивидендов - НДФЛ.СуммаСПревышения
		|																			ИНАЧЕ 0
		|																		КОНЕЦ
		|																КОГДА НДФЛ.НалогНаПрибыльДляДивидендов - НДФЛ.СуммаСПревышения < 0
		|																	ТОГДА НДФЛ.НалогНаПрибыльДляДивидендов - НДФЛ.СуммаСПревышения
		|																ИНАЧЕ 0
		|															КОНЕЦ
		|													ИНАЧЕ НДФЛ.НалогНаПрибыльДляДивидендов
		|												КОНЕЦ > 0
		|												ТОГДА НДФЛ.Сумма - ВЫБОР
		|														КОГДА НДФЛ.НалогНаПрибыльДляДивидендов * НДФЛ.СуммаСПревышения > 0
		|															ТОГДА ВЫБОР
		|																	КОГДА НДФЛ.СуммаСПревышения > 0
		|																		ТОГДА ВЫБОР
		|																				КОГДА НДФЛ.НалогНаПрибыльДляДивидендов - НДФЛ.СуммаСПревышения > 0
		|																					ТОГДА НДФЛ.НалогНаПрибыльДляДивидендов - НДФЛ.СуммаСПревышения
		|																				ИНАЧЕ 0
		|																			КОНЕЦ
		|																	КОГДА НДФЛ.НалогНаПрибыльДляДивидендов - НДФЛ.СуммаСПревышения < 0
		|																		ТОГДА НДФЛ.НалогНаПрибыльДляДивидендов - НДФЛ.СуммаСПревышения
		|																	ИНАЧЕ 0
		|																КОНЕЦ
		|														ИНАЧЕ НДФЛ.НалогНаПрибыльДляДивидендов
		|													КОНЕЦ
		|											ИНАЧЕ 0
		|										КОНЕЦ
		|								КОГДА НДФЛ.Сумма - ВЫБОР
		|										КОГДА НДФЛ.НалогНаПрибыльДляДивидендов * НДФЛ.СуммаСПревышения > 0
		|											ТОГДА ВЫБОР
		|													КОГДА НДФЛ.СуммаСПревышения > 0
		|														ТОГДА ВЫБОР
		|																КОГДА НДФЛ.НалогНаПрибыльДляДивидендов - НДФЛ.СуммаСПревышения > 0
		|																	ТОГДА НДФЛ.НалогНаПрибыльДляДивидендов - НДФЛ.СуммаСПревышения
		|																ИНАЧЕ 0
		|															КОНЕЦ
		|													КОГДА НДФЛ.НалогНаПрибыльДляДивидендов - НДФЛ.СуммаСПревышения < 0
		|														ТОГДА НДФЛ.НалогНаПрибыльДляДивидендов - НДФЛ.СуммаСПревышения
		|													ИНАЧЕ 0
		|												КОНЕЦ
		|										ИНАЧЕ НДФЛ.НалогНаПрибыльДляДивидендов
		|									КОНЕЦ < 0
		|									ТОГДА НДФЛ.Сумма - ВЫБОР
		|											КОГДА НДФЛ.НалогНаПрибыльДляДивидендов * НДФЛ.СуммаСПревышения > 0
		|												ТОГДА ВЫБОР
		|														КОГДА НДФЛ.СуммаСПревышения > 0
		|															ТОГДА ВЫБОР
		|																	КОГДА НДФЛ.НалогНаПрибыльДляДивидендов - НДФЛ.СуммаСПревышения > 0
		|																		ТОГДА НДФЛ.НалогНаПрибыльДляДивидендов - НДФЛ.СуммаСПревышения
		|																	ИНАЧЕ 0
		|																КОНЕЦ
		|														КОГДА НДФЛ.НалогНаПрибыльДляДивидендов - НДФЛ.СуммаСПревышения < 0
		|															ТОГДА НДФЛ.НалогНаПрибыльДляДивидендов - НДФЛ.СуммаСПревышения
		|														ИНАЧЕ 0
		|													КОНЕЦ
		|											ИНАЧЕ НДФЛ.НалогНаПрибыльДляДивидендов
		|										КОНЕЦ
		|								ИНАЧЕ 0
		|							КОНЕЦ
		|					ИНАЧЕ НДФЛ.Сумма
		|				КОНЕЦ
		|		КОГДА НДФЛ.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.Удержано)
		|				И (НДФЛ.ДатаПолученияДохода МЕЖДУ &НачалоПериода И &ОкончаниеПериода)
		|			ТОГДА -НДФЛ.Сумма
		|		КОГДА (НДФЛ.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.ВозвращеноНалоговымАгентом)
		|				ИЛИ НДФЛ.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.ЗачетАвансовыхПлатежей))
		|				И (НДФЛ.ДатаПолученияДохода МЕЖДУ &НачалоПериода И &ОкончаниеПериода)
		|				И НДФЛ.ДатаУдержания <= &ОкончаниеПериодаОсмотраДоходовВычетов
		|			ТОГДА -НДФЛ.Сумма
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Сальдо,
		|	ВЫБОР
		|		КОГДА НДФЛ.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.ВозвращеноНалоговымАгентом)
		|				И (НДФЛ.ДатаУдержания МЕЖДУ &НачалоПериода И &ОкончаниеПериода)
		|			ТОГДА -НДФЛ.Сумма
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Возвращено
		|ПОМЕСТИТЬ ВТНалогиПоСтавкам
		|ИЗ
		|	ВТНалоги КАК НДФЛ
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтавкаНДФЛПоНалогам КАК СтавкаНДФЛПоСтавкеРезидента
		|		ПО НДФЛ.ФизическоеЛицо = СтавкаНДФЛПоСтавкеРезидента.ФизическоеЛицо
		|			И НДФЛ.Период = СтавкаНДФЛПоСтавкеРезидента.Период
		|			И НДФЛ.СтавкаНалогообложенияРезидента = СтавкаНДФЛПоСтавкеРезидента.СтавкаНалогообложенияРезидента
		|			И НДФЛ.КатегорияДохода = СтавкаНДФЛПоСтавкеРезидента.КатегорияДохода
		|ГДЕ
		|	НДФЛ.Сумма <> 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	&КБКсПревышения,
		|	НДФЛ.ФизическоеЛицо,
		#Вставка
		|	НДФЛ.ДатаПолученияДохода Как ДатаПолученияДохода,
		|	НДФЛ.ДатаУдержания Как ДатаУдержания,
		|	НДФЛ.Регистратор Как Регистратор,
		#КонецВставки
		|	15,
		|	ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка15),
		|	ВЫБОР
		|		КОГДА НДФЛ.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				И (НДФЛ.ДатаПолученияДохода МЕЖДУ &НачалоПериода И &ОкончаниеПериода)
		|				И (НДФЛ.ДатаУдержания <= &ОкончаниеПериодаОсмотраДоходовВычетов
		|					ИЛИ НДФЛ.Регистратор <> НДФЛ.ДокументОснование)
		|			ТОГДА НДФЛ.СуммаСПревышения
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА НДФЛ.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				И (НДФЛ.ДатаПолученияДохода МЕЖДУ &НачалоПериода И &ОкончаниеПериода)
		|				И (НДФЛ.КатегорияДохода В (ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.Дивиденды), ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ДивидендыПоСтавке05), ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ДивидендыПоСтавке10), ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ДивидендыПоСтавке12))
		|					ИЛИ НДФЛ.КатегорияДохода = ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ДоходыПредыдущихРедакций)
		|						И НДФЛ.СтавкаНалогообложенияРезидента = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавкиНалогообложенияРезидента.Ставка09))
		|				И НДФЛ.ДатаУдержания <= &ОкончаниеПериодаОсмотраДоходовВычетов
		|			ТОГДА НДФЛ.СуммаСПревышения
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА НДФЛ.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.ЗачетАвансовыхПлатежей)
		|				И (НДФЛ.ДатаПолученияДохода МЕЖДУ &НачалоПериода И &ОкончаниеПериода)
		|				И НДФЛ.ДатаУдержания <= &ОкончаниеПериодаОсмотраДоходовВычетов
		|			ТОГДА НДФЛ.СуммаСПревышения
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА НДФЛ.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.Удержано)
		|				И (НДФЛ.ДатаУдержания МЕЖДУ &НачалоПериода И &ОкончаниеПериода)
		|			ТОГДА НДФЛ.СуммаСПревышения
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА НДФЛ.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.Удержано)
		|				И (НДФЛ.ДатаПолученияДохода МЕЖДУ &НачалоПериода И &ОкончаниеПериода)
		|			ТОГДА НДФЛ.СуммаСПревышения
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА НДФЛ.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				И (НДФЛ.ДатаПолученияДохода МЕЖДУ &НачалоПериода И &ОкончаниеПериода)
		|				И (НДФЛ.ДатаУдержания <= &ОкончаниеПериодаОсмотраДоходовВычетов
		|					ИЛИ НДФЛ.Регистратор <> НДФЛ.ДокументОснование)
		|			ТОГДА ВЫБОР
		|					КОГДА НДФЛ.НалогНаПрибыльДляДивидендов = 0
		|						ТОГДА НДФЛ.СуммаСПревышения
		|					КОГДА НДФЛ.НалогНаПрибыльДляДивидендов * НДФЛ.СуммаСПревышения > 0
		|						ТОГДА ВЫБОР
		|								КОГДА НДФЛ.СуммаСПревышения > 0
		|									ТОГДА ВЫБОР
		|											КОГДА НДФЛ.СуммаСПревышения - НДФЛ.НалогНаПрибыльДляДивидендов > 0
		|												ТОГДА НДФЛ.СуммаСПревышения - НДФЛ.НалогНаПрибыльДляДивидендов
		|											ИНАЧЕ 0
		|										КОНЕЦ
		|								КОГДА НДФЛ.СуммаСПревышения - НДФЛ.НалогНаПрибыльДляДивидендов < 0
		|									ТОГДА НДФЛ.СуммаСПревышения - НДФЛ.НалогНаПрибыльДляДивидендов
		|								ИНАЧЕ 0
		|							КОНЕЦ
		|					ИНАЧЕ НДФЛ.СуммаСПревышения
		|				КОНЕЦ
		|		КОГДА НДФЛ.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.Удержано)
		|				И (НДФЛ.ДатаПолученияДохода МЕЖДУ &НачалоПериода И &ОкончаниеПериода)
		|			ТОГДА -НДФЛ.СуммаСПревышения
		|		КОГДА (НДФЛ.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.ВозвращеноНалоговымАгентом)
		|				ИЛИ НДФЛ.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.ЗачетАвансовыхПлатежей))
		|				И (НДФЛ.ДатаПолученияДохода МЕЖДУ &НачалоПериода И &ОкончаниеПериода)
		|				И НДФЛ.ДатаУдержания <= &ОкончаниеПериодаОсмотраДоходовВычетов
		|			ТОГДА -НДФЛ.СуммаСПревышения
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА НДФЛ.ВариантУдержания = ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.ВозвращеноНалоговымАгентом)
		|				И (НДФЛ.ДатаУдержания МЕЖДУ &НачалоПериода И &ОкончаниеПериода)
		|			ТОГДА -НДФЛ.СуммаСПревышения
		|		ИНАЧЕ 0
		|	КОНЕЦ
		|ИЗ
		|	ВТНалоги КАК НДФЛ
		|ГДЕ
		|	НДФЛ.СуммаСПревышения <> 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Налоги.ФизическоеЛицо КАК ФизическоеЛицо,
		|	Налоги.СтавкаНалога КАК СтавкаНалога,
		|	СУММА(Налоги.Сальдо) КАК НеУдержано,
		|	Налоги.КБК КАК КБК
		|ПОМЕСТИТЬ ВТНеУдержано
		|ИЗ
		|	ВТНалогиПоСтавкам КАК Налоги
		|
		|СГРУППИРОВАТЬ ПО
		|	Налоги.ФизическоеЛицо,
		|	Налоги.СтавкаНалога,
		|	Налоги.КБК
		|
		|ИМЕЮЩИЕ
		|	СУММА(Налоги.Сальдо) > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Налоги.ФизическоеЛицо КАК ФизическоеЛицо,
		|	Налоги.СтавкаНалога КАК СтавкаНалога,
		|	Налоги.КБК КАК КБК,
		|	-СУММА(Налоги.Сальдо) КАК ИзлишнеУдержано
		|ПОМЕСТИТЬ ВТИзлишнеУдержаноПоКБК
		|ИЗ
		|	ВТНалогиПоСтавкам КАК Налоги
		|
		|СГРУППИРОВАТЬ ПО
		|	Налоги.ФизическоеЛицо,
		|	Налоги.СтавкаНалога,
		|	Налоги.КБК
		|
		|ИМЕЮЩИЕ
		|	СУММА(Налоги.Сальдо) < 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Налоги.ФизическоеЛицо КАК ФизическоеЛицо,
		#Вставка
		|	Налоги.ДатаПолученияДохода,
		|	Налоги.ДатаУдержания,
		|	Налоги.Регистратор,
		#КонецВставки
		|	Налоги.СтавкаНалога КАК СтавкаНалога,
		|	СУММА(Налоги.Начислено) КАК Начислено,
		|	СУММА(Налоги.НачисленоПоДивидендам) КАК НачисленоПоДивидендам,
		|	СУММА(Налоги.ЗачтеноАвансов) КАК ЗачтеноАвансов,
		|	СУММА(Налоги.Удержано) КАК Удержано,
		|	СУММА(Налоги.УдержаноЗаНалоговыйПериод) КАК УдержаноЗаНалоговыйПериод,
		|	СУММА(Налоги.Возвращено) КАК Возвращено,
		|	ЕСТЬNULL(МАКСИМУМ(ПоФизлицам.НеУдержано), 0) КАК НеУдержано,
		|	ЕСТЬNULL(МАКСИМУМ(ИзлишнеУдержаноПоКБК.ИзлишнеУдержано), 0) КАК ИзлишнеУдержано,
		|	Налоги.Ставка КАК Ставка,
		|	Налоги.КБК КАК КБК
		|ПОМЕСТИТЬ ВТДанныеПоФизлицам
		|ИЗ
		|	ВТНалогиПоСтавкам КАК Налоги
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНеУдержано КАК ПоФизлицам
		|		ПО Налоги.ФизическоеЛицо = ПоФизлицам.ФизическоеЛицо
		|			И Налоги.СтавкаНалога = ПоФизлицам.СтавкаНалога
		|			И Налоги.КБК = ПоФизлицам.КБК
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТИзлишнеУдержаноПоКБК КАК ИзлишнеУдержаноПоКБК
		|		ПО Налоги.ФизическоеЛицо = ИзлишнеУдержаноПоКБК.ФизическоеЛицо
		|			И Налоги.КБК = ИзлишнеУдержаноПоКБК.КБК
		|			И Налоги.СтавкаНалога = ИзлишнеУдержаноПоКБК.СтавкаНалога
		|ГДЕ
		|	(Налоги.Начислено <> 0
		|			ИЛИ Налоги.ЗачтеноАвансов <> 0
		|			ИЛИ Налоги.Удержано <> 0
		|			ИЛИ Налоги.Возвращено <> 0
		|			ИЛИ ИзлишнеУдержаноПоКБК.ИзлишнеУдержано <> 0)
		|
		|СГРУППИРОВАТЬ ПО
		|	Налоги.ФизическоеЛицо,
		#Вставка
		|	Налоги.ДатаПолученияДохода,
		|	Налоги.ДатаУдержания,
		|	Налоги.Регистратор,
		#КонецВставки
		|	Налоги.СтавкаНалога,
		|	Налоги.Ставка,
		|	Налоги.КБК";
		Запрос.Выполнить();
		
	КонецЕсли;
	
	Если ОписаниеТаблиц.Свойство("Раздел2Налоги") Тогда
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	Налоги.ФизическоеЛицо КАК ФизическоеЛицо,
		#Вставка
		|	Налоги.ДатаПолученияДохода Как ДатаПолученияДохода,
		|	Налоги.ДатаУдержания Как ДатаУдержания,
		|	Налоги.Регистратор Как Регистратор,
		#КонецВставки
		|	СУММА(Налоги.Начислено) КАК П000020014003,
		|	СУММА(Налоги.НачисленоПоДивидендам) КАК П000020014103,
		|	СУММА(Налоги.ЗачтеноАвансов) КАК П000020015003,
		|	СУММА(Налоги.Удержано) КАК П000020016003,
		|	СУММА(Налоги.НеУдержано) КАК П000020017003,
		|	СУММА(Налоги.Возвращено) КАК П000020019003,
		|	СУММА(Налоги.ИзлишнеУдержано) КАК П000020018003,
		|	Налоги.СтавкаНалога КАК СтавкаНалога,
		|	Налоги.Ставка КАК Ставка,
		|	Налоги.КБК КАК КБК
		|ИЗ
		|	ВТДанныеПоФизлицам КАК Налоги
		|ГДЕ
		|	(Налоги.Начислено <> 0
		|			ИЛИ Налоги.ЗачтеноАвансов <> 0
		|			ИЛИ Налоги.Удержано <> 0
		|			ИЛИ Налоги.Возвращено <> 0)
		|
		|СГРУППИРОВАТЬ ПО
		|	Налоги.СтавкаНалога,
		#Вставка
		|	Налоги.ДатаПолученияДохода,
		|	Налоги.ДатаУдержания,
		|	Налоги.Регистратор,
		#КонецВставки
		|	Налоги.Ставка,
		|	Налоги.КБК,
		|	Налоги.ФизическоеЛицо";
		#Удаление
		МассивПолей = Новый Массив;
		Если Не ПодробныеДанные Тогда
			МассивПолей.Добавить("ФизическоеЛицо");
		КонецЕсли;
		Запрос.Текст = УдалитьПоляРасшифровкиИзЗапроса(ТекстЗапроса, МассивПолей, "Налоги");
		#КонецУдаления
		#Вставка
		Запрос.Текст = ТекстЗапроса;
		#КонецВставки
		ОписаниеТаблиц.Раздел2Налоги = Запрос.Выполнить().Выгрузить();
		
	КонецЕсли;
	
	Если ОписаниеТаблиц.Свойство("Приложение1Итоги") Тогда
		
		УчетНДФЛ.СоздатьВТСтавкиНалогаЧислом(Запрос.МенеджерВременныхТаблиц);
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Налоги.ФизическоеЛицо КАК ФизическоеЛицо,
		|	Налоги.СтавкаНалога КАК СтавкаНалога,
		|	-СУММА(Налоги.Сальдо) КАК ИзлишнеУдержано
		|ПОМЕСТИТЬ ВТИзлишнеУдержано
		|ИЗ
		|	ВТНалогиПоСтавкам КАК Налоги
		|
		|СГРУППИРОВАТЬ ПО
		|	Налоги.ФизическоеЛицо,
		|	Налоги.СтавкаНалога
		|
		|ИМЕЮЩИЕ
		|	СУММА(Налоги.Сальдо) < 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеИтогов.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ДанныеИтогов.Ставка КАК Ставка,
		|	ДанныеИтогов.П000П1М100001 КАК П000П1М100001,
		|	СУММА(ДанныеИтогов.П000П1М100002) КАК П000П1М100002,
		|	СУММА(ДанныеИтогов.П000П1М100003) КАК П000П1М100003,
		|	СУММА(ДанныеИтогов.П000П1М100004) КАК П000П1М100004,
		|	СУММА(ДанныеИтогов.П000П1М100005) КАК П000П1М100005,
		|	СУММА(ДанныеИтогов.П000П1М100006) КАК П000П1М100006,
		|	СУММА(ДанныеИтогов.П000П1М100007) КАК П000П1М100007,
		|	СУММА(ДанныеИтогов.П000П1М100008) КАК П000П1М100008
		|ИЗ
		|	(ВЫБРАТЬ
		|		Налоги.ФизическоеЛицо КАК ФизическоеЛицо,
		|		Налоги.СтавкаНалога КАК Ставка,
		|		Налоги.СтавкаНалога КАК П000П1М100001,
		|		0 КАК П000П1М100002,
		|		0 КАК П000П1М100003,
		|		Налоги.Начислено КАК П000П1М100004,
		|		Налоги.УдержаноЗаНалоговыйПериод КАК П000П1М100005,
		|		Налоги.ЗачтеноАвансов КАК П000П1М100006,
		|		0 КАК П000П1М100007,
		|		0 КАК П000П1М100008
		|	ИЗ
		|		ВТДанныеПоФизлицам КАК Налоги
		|	ГДЕ
		|		(Налоги.Начислено <> 0
		|				ИЛИ Налоги.ЗачтеноАвансов <> 0
		|				ИЛИ Налоги.УдержаноЗаНалоговыйПериод <> 0)
		|
		|	ОБЪЕДИНИТЬ ВСЕ
		|
		|	ВЫБРАТЬ
		|		СведенияОДоходах.ФизическоеЛицо,
		|		СведенияОДоходах.СтавкаНалога,
		|		СведенияОДоходах.СтавкаНалога,
		|		СведенияОДоходах.СуммаДохода,
		|		СведенияОДоходах.СуммаДохода,
		|		0,
		|		0,
		|		0,
		|		0,
		|		0
		|	ИЗ
		|		ВТДоходыПоСтавкам КАК СведенияОДоходах
		|	ГДЕ
		|		СведенияОДоходах.ДанныеДляОтчета
		|
		|	ОБЪЕДИНИТЬ ВСЕ
		|
		|	ВЫБРАТЬ
		|		СведенияОДоходах.ФизическоеЛицо,
		|		СведенияОДоходах.СтавкаНалога,
		|		СведенияОДоходах.СтавкаНалога,
		|		0,
		|		-СведенияОДоходах.СуммаВычета,
		|		0,
		|		0,
		|		0,
		|		0,
		|		0
		|	ИЗ
		|		ВТВычетыПоСтавкам КАК СведенияОДоходах
		|
		|	ОБЪЕДИНИТЬ ВСЕ
		|
		|	ВЫБРАТЬ
		|		Налоги.ФизическоеЛицо,
		|		Налоги.СтавкаНалога,
		|		Налоги.СтавкаНалога,
		|		0,
		|		0,
		|		0,
		|		0,
		|		0,
		|		0,
		|		Налоги.ИзлишнеУдержано
		|	ИЗ
		|		ВТИзлишнеУдержано КАК Налоги
		|
		|	ОБЪЕДИНИТЬ ВСЕ
		|
		|	ВЫБРАТЬ
		|		РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.ФизическоеЛицо,
		|		СтавкиНалогаЧислом.Размер * 100,
		|		СтавкиНалогаЧислом.Размер * 100,
		|		0,
		|		0,
		|		0,
		|		0,
		|		0,
		|		РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.Сумма,
		|		0
		|	ИЗ
		|		РегистрНакопления.РасчетыНалоговыхАгентовСБюджетомПоНДФЛ КАК РасчетыНалоговыхАгентовСБюджетомПоНДФЛ
		|			ЛЕВОЕ СОЕДИНЕНИЕ ВТСтавкиНалогаЧислом КАК СтавкиНалогаЧислом
		|			ПО РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.Ставка = СтавкиНалогаЧислом.СтавкаНалогообложения
		|	ГДЕ
		|		РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|		И РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.Период МЕЖДУ &НачалоПредыдущегоГода И &ДатаПодписи
		|		И РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.РегистрацияВНалоговомОргане В(&РегистрацияВНалоговомОргане)
		|		И РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.МесяцНалоговогоПериода МЕЖДУ &НачалоПериода И &ОкончаниеПериода) КАК ДанныеИтогов
		|
		|СГРУППИРОВАТЬ ПО
		|	ДанныеИтогов.Ставка,
		|	ДанныеИтогов.ФизическоеЛицо,
		|	ДанныеИтогов.П000П1М100001
		|
		|ИМЕЮЩИЕ
		|	СУММА(ДанныеИтогов.П000П1М100002) <> 0";
		
		ОписаниеТаблиц.Приложение1Итоги = Запрос.Выполнить().Выгрузить()
		
	КонецЕсли;
	
	Если ОписаниеТаблиц.Свойство("Приложение1УведомленияОВычетах") Тогда
		
		НалоговыйПериод = Год(ОкончаниеПериода);
		
		Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СведенияОДоходах.ФизическоеЛицо КАК ФизическоеЛицо
		|ИЗ
		|	ВТВычетыПоСтавкам КАК СведенияОДоходах
		|ГДЕ
		|	СведенияОДоходах.КодВычета.ГруппаВычета <> ЗНАЧЕНИЕ(Перечисление.ГруппыВычетовПоНДФЛ.ПустаяСсылка)";
		ДанныеУведомлений = УчетНДФЛ.ДанныеУведомленийНаВычеты(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ФизическоеЛицо"), НалоговыйПериод, Организация);
		ДанныеУведомлений.Колонки.Сотрудник.Имя = "ФизическоеЛицо";
		ОписаниеТаблиц.Приложение1УведомленияОВычетах = ДанныеУведомлений;
		
		Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Налоги.ФизическоеЛицо КАК ФизическоеЛицо
		|ИЗ
		|	ВТДанныеПоФизлицам КАК Налоги
		|ГДЕ
		|	Налоги.ЗачтеноАвансов <> 0";
		ДанныеУведомлений = УчетНДФЛ.ДанныеУведомленийНаЗачетАвансовыхПлатежей(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ФизическоеЛицо"), НалоговыйПериод, Организация);
		ДанныеУведомлений.Колонки.Добавить("ГруппаВычета", Новый ОписаниеТипов("ПеречислениеСсылка.ГруппыВычетовПоНДФЛ"));
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ДанныеУведомлений, ОписаниеТаблиц.Приложение1УведомленияОВычетах);
		ОписаниеТаблиц.Приложение1УведомленияОВычетах.Колонки.НомерУведомления.Имя = "П000П1М300002";
		ОписаниеТаблиц.Приложение1УведомленияОВычетах.Колонки.ДатаУведомления.Имя = "П000П1М300003";
		ОписаниеТаблиц.Приложение1УведомленияОВычетах.Колонки.КодНалоговогоОрганаУведомления.Имя = "П000П1М300004";
		
	КонецЕсли;
	
КонецПроцедуры




//1АБ- Беляев 28.05.2021
#КонецОбласти
