
&ИзменениеИКонтроль("ТаблицаНачислений")
Функция АБ_ТаблицаНачислений() Экспорт

	МассивТиповВидаРасчета = Новый Массив;
	МассивТиповВидаРасчета.Добавить(Тип("СправочникСсылка.ВидыРасчетовРезервовПоОплатеТруда"));
	МассивТиповВидаРасчета.Добавить(Тип("ПланВидовРасчетаСсылка.Начисления"));

	Начисления = Новый ТаблицаЗначений;
	Начисления.Колонки.Добавить("Сотрудник", Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));
	Начисления.Колонки.Добавить("Начисление", Новый ОписаниеТипов(МассивТиповВидаРасчета));
	Начисления.Колонки.Добавить("ДатаНачала", Новый ОписаниеТипов("Дата"));
	Начисления.Колонки.Добавить("ДатаОкончания", Новый ОписаниеТипов("Дата"));
	Начисления.Колонки.Добавить("ИдентификаторСтроки", Новый ОписаниеТипов("Число"));

	Начисления.Колонки.Добавить("ПериодПолученияПоказателей", Новый ОписаниеТипов("Дата"));
	Начисления.Колонки.Добавить("Показатели", Новый ОписаниеТипов("ТаблицаЗначений"));
	Начисления.Колонки.Добавить("ИзвестныеПоказатели", Новый ОписаниеТипов("ТаблицаЗначений"));

	Начисления.Колонки.Добавить("Организация", Новый ОписаниеТипов("СправочникСсылка.Организации"));
	Начисления.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.ПодразделенияОрганизаций"));

	Начисления.Колонки.Добавить("ГрафикРаботы", Новый ОписаниеТипов("СправочникСсылка.ГрафикиРаботыСотрудников,СправочникСсылка.Сотрудники"));
	Начисления.Колонки.Добавить("ГрафикРаботыНорма", Новый ОписаниеТипов("СправочникСсылка.ГрафикиРаботыСотрудников,СправочникСсылка.Сотрудники"));
	Начисления.Колонки.Добавить("ОбщийГрафик", Новый ОписаниеТипов("СправочникСсылка.ГрафикиРаботыСотрудников"));
	Начисления.Колонки.Добавить("ПериодРегистрацииВремени", Новый ОписаниеТипов("Дата"));
	Начисления.Колонки.Добавить("ПериодРегистрацииНормыВремени", Новый ОписаниеТипов("Дата"));
	Начисления.Колонки.Добавить("ВремяВЧасах", Новый ОписаниеТипов("Булево"));
	Начисления.Колонки.Добавить("ВремяВЦеломЗаПериод", Новый ОписаниеТипов("Булево"));
	Начисления.Колонки.Добавить("ПериодДействия", Новый ОписаниеТипов("Дата"));
	Начисления.Колонки.Добавить("ПериодРегистрации", Новый ОписаниеТипов("Дата"));

	Начисления.Колонки.Добавить("Категория", Новый ОписаниеТипов("ПеречислениеСсылка.КатегорииНачисленийИНеоплаченногоВремени"));
	Начисления.Колонки.Добавить("ВидЗанятости", Новый ОписаниеТипов("ПеречислениеСсылка.ВидыЗанятости"));

	Начисления.Колонки.Добавить("ФизическоеЛицо", Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
	Начисления.Колонки.Добавить("ДокументОснование", Метаданные.ОпределяемыеТипы.ОснованиеНачисления.Тип);

	Начисления.Колонки.Добавить("Должность", Новый ОписаниеТипов("СправочникСсылка.Должности"));
	Начисления.Колонки.Добавить("ДолжностьПоШтатномуРасписанию", Новый ОписаниеТипов("СправочникСсылка.ШтатноеРасписание"));

	Начисления.Колонки.Добавить("Сумма", ОписаниеТиповСуммаРезультат());
	Начисления.Колонки.Добавить("Результат", ОписаниеТиповСуммаРезультат());

	Начисления.Колонки.Добавить("КодВычета", Новый ОписаниеТипов("СправочникСсылка.ВидыВычетовНДФЛ"));
	Начисления.Колонки.Добавить("СуммаВычета", Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(15, 2)));
	Начисления.Колонки.Добавить("ФиксСуммаВычета", Новый ОписаниеТипов("Булево"));
	Начисления.Колонки.Добавить("СкидкаПоВзносам", Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(15, 2)));
	Начисления.Колонки.Добавить("СторнируемыйДокумент", Документы.ТипВсеСсылки());
	Начисления.Колонки.Добавить("КоличествоДетей", Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(7, 0)));
	Начисления.Колонки.Добавить("ВычетПредоставленныйДругомуРодителю", Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(7, 0)));

	Начисления.Колонки.Добавить("Сторно", Новый ОписаниеТипов("Булево"));
	Начисления.Колонки.Добавить("ФиксСторно", Новый ОписаниеТипов("Булево"));
	Начисления.Колонки.Добавить("НулевоеСторно", Новый ОписаниеТипов("Булево"));

	Начисления.Колонки.Добавить("ЗаписьРасчета");

	Начисления.Колонки.Добавить("Дополнительно", Новый ОписаниеТипов("Структура"));
	Начисления.Колонки.Добавить("ТерриторииУсловияТруда", Новый ОписаниеТипов("ТаблицаЗначений"));
	Начисления.Колонки.Добавить("Вычеркнуть", Новый ОписаниеТипов("Булево"));

	Начисления.Колонки.Добавить("ФиксСтрока", Новый ОписаниеТипов("Булево"));
	Начисления.Колонки.Добавить("ФиксЗаполнение", Новый ОписаниеТипов("Булево"));
	Начисления.Колонки.Добавить("ФиксРасчетВремени", Новый ОписаниеТипов("Булево"));
	Начисления.Колонки.Добавить("ФиксРасчет", Новый ОписаниеТипов("Булево"));

	Начисления.Колонки.Добавить("ОтработаноДней", Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(5, 0)));
	Начисления.Колонки.Добавить("ОтработаноЧасов", Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(5, 2)));
	Начисления.Колонки.Добавить("ОплаченоДней", Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(5, 2)));
	Начисления.Колонки.Добавить("ОплаченоЧасов", Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(5, 2)));
	Начисления.Колонки.Добавить("НормаДней", Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(2, 0)));
	Начисления.Колонки.Добавить("НормаЧасов", Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(5, 2)));

	Начисления.Колонки.Добавить("РаспределениеПоСтатьям", Новый ОписаниеТипов("ТаблицаЗначений"));

	Начисления.Колонки.Добавить("НачалоБазовогоПериода", Новый ОписаниеТипов("Дата"));
	Начисления.Колонки.Добавить("ОкончаниеБазовогоПериода", Новый ОписаниеТипов("Дата"));

	Начисления.Колонки.Добавить("ЗарегистрированоВремяПоНабору", Новый ОписаниеТипов("Булево"));

	Начисления.Колонки.Добавить("РассчитыватьПоРазовымНачислениямДокумента", Новый ОписаниеТипов("Булево"));
	Начисления.Колонки.Добавить("РегистраторРазовогоНачисления", Метаданные.ОпределяемыеТипы.РегистраторРазовогоНачисления.Тип);
	Начисления.Колонки.Добавить("ИсходныйДокумент", Метаданные.ОпределяемыеТипы.СторнируемыйДокумент.Тип);
	Начисления.Колонки.Добавить("КорректировкаРанееВыполненногоНачисления", Новый ОписаниеТипов("Булево"));
	Начисления.Колонки.Добавить("РанееНачислено", ОписаниеТиповСуммаРезультат());
	Начисления.Колонки.Добавить("РезультатФСС", ОписаниеТиповСуммаРезультат());
	Начисления.Колонки.Добавить("ПроцентОплаты", ОбщегоНазначения.ОписаниеТипаЧисло(5, 2));
	Начисления.Колонки.Добавить("ПроцентОплатыБезЛьгот", ОбщегоНазначения.ОписаниеТипаЧисло(5, 2));
	Начисления.Колонки.Добавить("ОграничениеПособия", Новый ОписаниеТипов("ПеречислениеСсылка.ВидыОграниченияПособия"));
	Начисления.Колонки.Добавить("ОграничениеПособияБезЛьгот", Новый ОписаниеТипов("ПеречислениеСсылка.ВидыОграниченияПособия"));

	Начисления.Колонки.Добавить("Владелец");

	Начисления.Колонки.Добавить("МестоПолученияДохода", Метаданные.ОпределяемыеТипы.ТерриторияВыполненияРаботВОрганизации.Тип);
	#Вставка
	//1АБ Беляев 05.04.2021 + Доработка "Использовать нетиповой расчет ночных/праздничных" + 04.07.2021 Доработка 8 "Возможно выбрать доплату за ночные / праздничные в разовом начислении"
	Начисления.Колонки.Добавить("АБ_Сторно", Новый ОписаниеТипов("Булево"));
	//1АБ Беляев 05.04.2021 + Доработка "Использовать нетиповой расчет ночных/праздничных" + 04.07.2021 Доработка 8 "Возможно выбрать доплату за ночные / праздничные в разовом начислении"
	#КонецВставки

	Возврат Начисления;

КонецФункции
