#Область Доработка_6_1_ВозможностьРедактированияПериодаРасчета
&НаКлиенте
&ИзменениеИКонтроль("ПриИзмененииПериодаРасчета")
Процедура АБ_ПриИзмененииПериодаРасчета(ДатаДоИзменения, ИмяРеквизита)

	Отказ = Ложь;

	Если НачалоПериодаРасчета > ОкончаниеПериодаРасчета
		Или Не ЗначениеЗаполнено(НачалоПериодаРасчета) 
		Или Не ЗначениеЗаполнено(ОкончаниеПериодаРасчета) Тогда
		// Ошибка настройки периода
		Отказ = Истина;
	КонецЕсли;

	Если НачалоМесяца(ДатаПриемаНаРаботуСотрудника) = НачалоМесяца(ДатаНачалаСобытия) Тогда
		// Если сотрудник принят в месяце начала события, то период может включать месяц начала события.
		Если ОкончаниеПериодаРасчета > КонецМесяца(ДатаНачалаСобытия) Тогда
			Отказ = Истина;
		КонецЕсли;
	ИначеЕсли ПериодДоНачалаСобытияИсключаетсяИзРасчетаСреднегоЗаработка Тогда
		// Если весь период с даты приема исключается из расчета среднего заработка,
		// то период может включать месяц начала события.
		Если ОкончаниеПериодаРасчета > КонецМесяца(ДатаНачалаСобытия) Тогда
			Отказ = Истина;
		КонецЕсли;
	Иначе
		#Удаление
		Если ОкончаниеПериодаРасчета > КонецМесяца(ДобавитьМесяц(ДатаНачалаСобытия, -1)) Тогда
			Отказ = Истина;
		КонецЕсли;
		#КонецУдаления
		#Вставка
		//1АБ Беляев 19.03.2021 +
		Если НЕ ТипЗнч(ЭтаФорма.ВладелецФормы.Объект.Ссылка)=Тип("ДокументСсылка.РазовоеНачисление") И НЕ ТипЗнч(ЭтаФорма.ВладелецФормы.Объект.Ссылка)=Тип("ДокументСсылка.Премия") И ОкончаниеПериодаРасчета > КонецМесяца(ДобавитьМесяц(ДатаНачалаСобытия, -1)) Тогда
			Отказ = Истина;
		КонецЕсли;
		//1АБ Беляев 19.03.2021 - 
		#КонецВставки
	КонецЕсли;

	Если Отказ Тогда
		ЭтаФорма[ИмяРеквизита] = ДатаДоИзменения;
		ЗарплатаКадрыКлиентСервер.ЗаполнитьМесяцПоДате(ЭтаФорма, ИмяРеквизита, ИмяРеквизита + "Строкой");
		Возврат;
	КонецЕсли;

	ПриИзмененииПериодаРасчетаНаСервере();

КонецПроцедуры

#КонецОбласти