&НаКлиенте
Процедура ОчиститьРСДляСреднегоОбщий(Команда)
	ОчиститьРСДляСреднегоОбщийНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОчиститьРСДляСреднегоОбщийНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ДанныеОВремениДляРасчетаСреднегоОбщийКорректировка.Сотрудник КАК Сотрудник,
	               |	ДанныеОВремениДляРасчетаСреднегоОбщийКорректировка.Месяц КАК Месяц,
	               |	ДанныеОВремениДляРасчетаСреднегоОбщийКорректировка.ПорядокРасчета КАК ПорядокРасчета
	               |ИЗ
	               |	РегистрСведений.ДанныеОВремениДляРасчетаСреднегоОбщийКорректировка КАК ДанныеОВремениДляРасчетаСреднегоОбщийКорректировка
	               |ГДЕ
	               |	НАЧАЛОПЕРИОДА(ДанныеОВремениДляРасчетаСреднегоОбщийКорректировка.Месяц, МЕСЯЦ) >= &ДатаНачала
	               |	И НАЧАЛОПЕРИОДА(ДанныеОВремениДляРасчетаСреднегоОбщийКорректировка.Месяц, МЕСЯЦ) <= &ДатаОкончания";
	Запрос.УстановитьПараметр("ДатаНачала",НачалоМесяца(Объект.ДатаНачала));
	Запрос.УстановитьПараметр("ДатаОкончания",КонецМесяца(Объект.ДатаОкончания));
	Результат = Запрос.Выполнить();
	Выборка=Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		МенеджерЗаписи=РегистрыСведений.ДанныеОВремениДляРасчетаСреднегоОбщийКорректировка.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи,Выборка,"Сотрудник,Месяц,ПорядокРасчета");
		МенеджерЗаписи.Прочитать();
		МенеджерЗаписи.Удалить();
	КонецЦикла;
		
КонецПроцедуры

&НаСервере
Процедура ОчиститьРС_СведенияНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ДанныеОВремениДляРасчетаСреднегоОбщийКорректировка.Сотрудник КАК Сотрудник,
	               |	ДанныеОВремениДляРасчетаСреднегоОбщийКорректировка.Месяц КАК Месяц,
	               |	ДанныеОВремениДляРасчетаСреднегоОбщийКорректировка.ПорядокРасчета КАК ПорядокРасчета
	               |ИЗ
	               |	РегистрСведений.СведенияОВремениДляРасчетаСреднегоОбщий КАК ДанныеОВремениДляРасчетаСреднегоОбщийКорректировка
	               |ГДЕ
	               |	НАЧАЛОПЕРИОДА(ДанныеОВремениДляРасчетаСреднегоОбщийКорректировка.Месяц, МЕСЯЦ) >= &ДатаНачала
	               |	И НАЧАЛОПЕРИОДА(ДанныеОВремениДляРасчетаСреднегоОбщийКорректировка.Месяц, МЕСЯЦ) <= &ДатаОкончания";
	Запрос.УстановитьПараметр("ДатаНачала",НачалоМесяца(Объект.ДатаНачала));
	Запрос.УстановитьПараметр("ДатаОкончания",КонецМесяца(Объект.ДатаОкончания));
	Результат = Запрос.Выполнить();
	Выборка=Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		МенеджерЗаписи=РегистрыСведений.СведенияОВремениДляРасчетаСреднегоОбщий.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи,Выборка,"Сотрудник,Месяц,ПорядокРасчета");
		МенеджерЗаписи.Прочитать();
		МенеджерЗаписи.Удалить();
	КонецЦикла;

// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьРС_Сведения(Команда)
	ОчиститьРС_СведенияНаСервере();
КонецПроцедуры


