#Область АБ_Доработка1_ПромежуточныеФункции_От_ГрафическогоИнтерфейса_До_ФункцииПолученияНужногоЗначения_4
&ИзменениеИКонтроль("ПараметрыПолученияДанныхЗаполненияДокумента")
Функция АБ_ПараметрыПолученияДанныхЗаполненияДокумента() Экспорт

	СтруктураПараметров = Новый Структура(
	"Организация, 
	|ДокументСсылка, 
	|Подразделение, 
	|МесяцНачисления, 
	|Сотрудники,
	|ФизическиеЛица,
	|ОкончаниеПериода, 
	|РежимНачисления, 
	|ПорядокВыплаты, 
	|ДатаВыплаты, 
	|ОписаниеДокумента, 
	|СодержимоеДокумента, 
	|СохранятьИсправления,
	|КонтролируемыеПоля,
	#Вставка
	//1АБ Беляев 08.03.2021 +
	|ИспользоватьНеТиповойРасчетНочных,
	|ИспользоватьНеТиповойРасчетПраздничных,
	//1АБ Беляев 08.03.2021 -
	#КонецВставки
	|РежимПересчетаНДФЛ,
	|РежимПересчетаВзносов,
	|РаспределениеРезультатов,
	|ДанныеРаспределенияПоТерриториямУсловиямТруда,
	|СотрудникиПериодДействияПерерасчет,
	|ИспользоватьВоеннуюСлужбу,
	|НачислениеЗарплатыВоеннослужащим,
	|ОкончательныйРасчетНДФЛ,
	|ПозицииВставки,
	|ПроверятьРегистрациюПроцентаЕНВД");

	СтруктураПараметров.РежимПересчетаНДФЛ = Ложь;
	СтруктураПараметров.РежимПересчетаВзносов = Ложь;
	СтруктураПараметров.ИспользоватьВоеннуюСлужбу = Ложь;
	СтруктураПараметров.НачислениеЗарплатыВоеннослужащим = Ложь;
	СтруктураПараметров.ОкончательныйРасчетНДФЛ = Ложь;
	СтруктураПараметров.ПозицииВставки = Новый Структура;
	СтруктураПараметров.ПроверятьРегистрациюПроцентаЕНВД = Ложь;
	#Вставка
	//1АБ Беляев 08.03.2021 +
	СтруктураПараметров.ИспользоватьНеТиповойРасчетНочных=Ложь;
	СтруктураПараметров.ИспользоватьНеТиповойРасчетПраздничных=Ложь;
	//1АБ Беляев 08.03.2021 -
	#КонецВставки

	Возврат СтруктураПараметров;

КонецФункции
#КонецОбласти


