
#Область ВыборИмениФайла
&НаКлиенте
Процедура АдресФайлаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершениеВыбораФайла", ЭтаФорма);
	НачатьПомещениеФайла(ОписаниеОповещения, , , Истина, УникальныйИдентификатор);

КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеВыбораФайла(Результат, Адрес, ВыбранноеИмяФайла, ДополнительныеПараметры) Экспорт 
	Если Результат Тогда
		Отчет.АдресФайла = ВыбранноеИмяФайла;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти





